<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Üdvözlünk a gyorstalpalóban</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="Welcome to the Quick Start Guide" />
	</head>
	<body>
		
		
		<h1>Üdvözlünk a gyorstalpalóban</h1>
		
		<h2>Szia és üdvözlünk a gyorstalpalóban.</h2>

<p>A következ&otilde; fejezetekben, némi betekintést nyújtunk a grandMA2 néhány gyakran használt funkciójáról.</p>

<p>Ez egy kicsit személyesebb útmutató a grandMA2 szoftverér&otilde;l, és én (a szerz&otilde;) végigvezetlek téged (az olvasót), úgy, hogy sokkal direktebb és könnyeben értelmezhet&otilde; módon írok, mint a kézikönyv többi részében. Remélem tetszeni fog.</p>

<p>Nem fecsérelünk id&otilde;t a pult vagy az onPC program beüzemelésére.</p>

<p>Úgy kezdjük, hogy minden szépen megy és m&ucirc;ködik. Ha mégis inkább beállítanál dolgokat, miel&otilde;tt ezt elolvasod, akkor nézd meg ezeket:<a href="../key_first_steps.html">Els&otilde; lépések fejezet</a>. Ha szükséged van segítségre a telepítéshez, és a program futtatásához PC-n akkor itt:<a href="../key_onpc_details.html">grandMA2 onPC részletek</a>&nbsp;vagy itt<a href="../key_introduction_installation_of_grandma2_onpc.html">Bevezetés</a>találsz részleteket.</p>

<h2>El&otilde;szó</h2>

<p>Ez a leírás els&otilde;sorban a grandMA2 onPC változathoz íródott. A gondolata ennek az, hogy a legtöbb felhasználó általában itt kezdi az onPC felületen Ha van különbség az onPC és az igazi pult kezelése között, akkor azt majd ott kifejtjük.</p>

<p>Egy egér/hanyattegér er&otilde;sen ajánlott. Gyakran a leírás azt mondja "kattints rá", ez ugyanaz mintha az ujjacskáddal rányomnál az érint&otilde;képerny&otilde;n a pulton valamire. "Jobb kattintás a lámpa számán" ez ugyanaz mintha el&otilde;ször megnyomod az <span class="hardkey">Edit</span> gombot aztán ráböksz a lámpa számára a pulton. Hanyattegeret és hagyományos egeret is használhatsz a pulton, ez rád van bízva.</p>

<p>Ha az onPC változatot használod, akkor sokat fogsz "Virtuális" képerny&otilde;kön dolgozni. Ha a"képerny&otilde; 1" re lesz hivatkozás akkor az az amelyik a <strong>Command(parancs)</strong> részen van - Jobb oldali gombok közül. Ha az onPC "MultiScreen(több képerny&otilde;s)" módban fut (onPC beállításoknál), akkor ez a f&otilde; ablakod lesz és nem látsz "Command" gombot a jobb oldalon. Az executorokat eléreheted ha az <span class="softkey">Executor 1 - 15 101 - 115</span> gombokra böksz a jobb oldalon. A különböz&otilde; képerny&otilde;k elérhet&otilde;ek a jobb oldali megfelel&otilde; gombra kattintva.</p>

<p>Néha szükség lehet hogy a nagy executorokhoz is hozzáférjünk.A pulton ezek a nagy 100mm húzók, amik alatt 3 nagy buta gomb van. Az onPC-n ezeket megtalálod ha a jobb oldalon a <span class="softkey">Masters</span> gombra kattintasz.</p>

<p>Javasolt hogy ezt online olvasd(bár nincs magyar nyelv&ucirc; változat), mert ez a legfrissebb változat. De ha akarod letöltheted mint pdf és ki is nyomtathatod magadnak. De a fák megmentése érdekében jobb ha magaddal viszed a PDF-et, és olvashatod a kedvenc elektronikus kütyüdön is.<br />
Egyik nyer&otilde; platform az onPC ahol ez a leírás is elérhet&otilde;, a súgóban - és akkor még PDF-re sincs szükséged.</p>

<p>A gyorstalpaló azt jelenti hogy általában az elejét&otilde;l a végéig elolvassák, mert kezd&otilde;knek és a dologgal most ismerked&otilde;knek van. Ha egy speciális problémára keresel megoldást akkor nézd meg a menüben itt bal oldalon, vagy keress rá az online leírásban.</p>

<p>A legjobb eredmény elérése érdekében, próbáld meg pontosan azt csinálni ami itt le van írva. Ha valamit másképp csinálsz és nem a leírt módon, akkor más eredményed lehet - és ett&otilde;l elszomorodhatsz, meg depressziós lehetsz, pedig a világítás jó móka kéne, hogy legyen :-)</p>

<h2>Jelölések a Gyorstalpalóban</h2>

<p>Ebben a leírásban különböz&otilde; jelöléseket használunk, különböz&otilde; szituációkban.</p>

<p>Annak ellenére, hogy ez onPC-re íródott, nagyon sok (virtuális) gombnyomásra lesz szükség. Ha meg kell nyomni vagy kattintani a gombokat, akkor ez így jelenik meg: <span class="hardkey">Store</span> <span class="hardkey">Cue</span> <span class="hardkey">1</span> <span class="hardkey">Please</span>.</p>

<p>Ha csak egy gombról beszélünk akkor egyszeres idéz&otilde;jelben írjuk. A 'Store' gomb például.</p>

<p>Ha van egy terület a képerny&otilde;n ahova kattintani kell, vagy vagy megnyomni valamit akkor azt így írjuk <span class="softkey">Internal</span>. Ez lehet a füleken, a menükben vagy egy gomb a képerny&otilde;n.&nbsp;</p>

<p>Ha egy kifejezésr&otilde;l beszélünk akkor az:<strong>Store</strong> (Tárolás), ami egy funkció, hogy elmenthessünk valamit.&nbsp;</p>

<p>Ha billenty&ucirc;zetet kell használni, és írni kell valamit a parancssorba (kés&otilde;bb megnézzük), akkor ez így néz ki:</p>

<div class="cl_input">[Channel]&gt; Store cue 1</div>

<p>Minden parancsot az Enter megnyomásával lehet végrehajtani. Ez nincs kijelezve. Ez ugyanaz mint a <span class="hardkey">Please(kérem)</span> gomb. Ez nem egy látható parancs- ez az a gomb ami végrehajtja a beírt parancsokat. Van egy alapértelmezett kulcsszó a parancssorban. Ez az a szó ami szögletes zárójelben van []. Ezeket nem kell beírni, mert már ott van - eltérhet attól, mint amit itt fenn látsz.</p>

<p>Egy visszajelzés a rendszer részér&otilde;l így nézhet ki:</p>

<div class="cl_response"><em>[time]</em> : Executing : Store cue 1</div>

<p>Figyeld meg, hogy a Please vagy Entert nem írja ki.</p>

<p>Ha valamit a billenty&ucirc;zetr&otilde;l kell beírni ami nincs a parancssorban, akkor a billenty&ucirc;bevitel így néz ki: <span class="syntax">store cue 1</span>.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>Szóval kezdjünk is neki. Ellen&otilde;rizd, hogy az onPC fut, vagy a pult m&ucirc;ködik és akor mehetünk a <a href="key_01_create_new_show.html">következ&otilde; oldalra</a>.</p>

<p>&nbsp;</p>

		
	</body>
</html>
