<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Szekvencia szerkesztése</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="quick start guide - edit sequence" />
	</head>
	<body>
		
		
		<h1>Szekvencia szerkesztése</h1>
		
		<p>Most pedig, némi változtatást eszközölünk a szekvenciánkon.</p>

<h2>Csinálj egy "Follow(követést)"</h2>

<p>Most pedig megváltoztatjuk a szekvenciát, hogy a 3. kép automatikusan következzen a 2. kép után.</p>

<p>Nézd meg a szekvencia végrehajtó táblázatot. Minden képnek megvan a saját sora. Az oszlopok különböz&otilde; tulajdonságait takarják a képeknek. Ez nem a <strong>content(tartalom)</strong> a képben, hanem a <strong>cue(kép)</strong> tulajdonságait.</p>

<p>A trig oszlop irányítja, azt hogy a képet mi indítja el. Meg kellene változtatni a 3. kép beállítását.&nbsp;Ezt lehet jobb-klikkel az egérrel (vagy az 'Edit' és ráböksz) a képerny&otilde;n oda ahol a "Go" felirat van a "Trig" oszlopban, abban a sorban ahol a 3. kép van.</p>

<p>Ekkor egy kis ablakocska jön el&otilde;, a következ&otilde; választási lehet&otilde;ségekkel: Go(menj), Time(id&otilde;), Follow(követ), Sound(hang), BPM, Timecode(id&otilde;kód). Válaszd a <span class="softkey">Follow</span>-t kattintással, vagy bökéssel.</p>

<p>Most ha a 2. kép "készen" van, akkor a pult automatikusan elindítja a 3. képváltást.</p>

<h2>Képek nevének megváltoztatása</h2>

<p>Változtassuk meg a képek nevét. Most már tudod hogyan lehetséges, ezért itt egy táblázat az új nevekr&otilde;l:</p>

<table>
	<tbody>
		<tr>
			<th>Kép Száma:</th>
			<th>Név:</th>
			<th>Magyarul:</th>
		</tr>
		<tr>
			<td>1</td>
			<td>Behind Curtain</td>
			<td>Függöny mögött</td>
		</tr>
		<tr>
			<td>2</td>
			<td>With Curtain Up</td>
			<td>Függöny nyitásra</td>
		</tr>
		<tr>
			<td>3</td>
			<td>Build</td>
			<td>Épül</td>
		</tr>
		<tr>
			<td>4</td>
			<td>Darker</td>
			<td>Sötétebb</td>
		</tr>
		<tr>
			<td>5</td>
			<td>Cold</td>
			<td>Hideg</td>
		</tr>
		<tr>
			<td>6</td>
			<td>B.O.</td>
			<td>Sötét</td>
		</tr>
	</tbody>
</table>

<p>Ha jobban akarod látni a "name" mez&otilde;t, akkor az egérrel az oszlopok közti vonalat mozgatva megteheted.</p>

<h2>Kép frissítése</h2>

<p>Képzeld el, hogy van egy világítástervez&otilde;, akinek az a nagyszer&ucirc; ötlete támad, hogy mi lenne, ha 5% -al többet kér a csoportból aminek a neve "LX 1 Warm", a harmadik képben. Menj a harmadik képre:&nbsp;<span class="hardkey">Goto</span>&nbsp;<span class="hardkey">3</span>&nbsp;<span class="hardkey">Time</span>&nbsp;<span class="hardkey">0</span>&nbsp;<span class="hardkey">Please</span>.</p>

<p>Mi történt? Odaugrottunk a képre és aktiváltuk az executort. És most egy sárga keret van a 3. kép körül a Sequence Executor Táblázatban. A 3. képre ugráshoz csak annyit kellett beírni, hogy "Goto 3 Please". Hozzáadtuk még a "Time 0"-t. Ez átugorja a képben tárolt id&otilde;ket, így nem kell várni arra, hogy bejöjjön a kép. Ez nem változtatja meg az eltárolt beúszási id&otilde;t.</p>

<p>Folytassuk:&nbsp;<span class="hardkey">Group</span>&nbsp;<span class="hardkey">2</span>&nbsp;<span class="hardkey">At</span>&nbsp;<span class="hardkey">+</span>&nbsp;<span class="hardkey">5</span>&nbsp;<span class="hardkey">Please</span>.</p>

<p>Most az 'Update'(frissítés) gomb világítani kezd. Ez jelent azt, hogy frissítheted az aktív képet. Nyomd meg az&nbsp;<span class="hardkey">Update</span>&nbsp;gombot és semmivel sem tör&otilde;dve nyomd meg az <span class="hardkey">U3</span> gombot (vagy ahol ez van írva: <span class="softkey">Tracking Update</span>) akkor a gomb átvált "Update Cue Only". Most nyomd meg az&nbsp;<span class="hardkey">X6</span>&nbsp;gombot (vagy ahol azt írja <span class="softkey">Update Cue</span>), hogy frissítsd a képet.</p>

<p>Hogy kilépjünk a képb&otilde;l és kikapcsoljuk a szekvenciát, ahhoz nyomd meg a legfels&otilde; gombot az 1. executor húzónál - az onPC változatban megnyithatod az executor nézetet és bökj oda ahol az "Off" felirat van az els&otilde; executor felett.</p>

<h2>Szerkesszük az id&otilde;ket</h2>

<p>Változtasunk némi átúszási id&otilde;ket a képek listájában. Itt van a végleges állapot:</p>

<table>
	<tbody>
		<tr>
			<th>Fade(úszási id&otilde;)</th>
			<th>Out Fade(kiúszási id&otilde;)</th>
			<th>Delay(késleltetés)</th>
			<th>Out Delay(kiúszási késleltetés)</th>
		</tr>
		<tr>
			<td>0</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
		</tr>
		<tr>
			<td>15</td>
			<td>&nbsp;</td>
			<td>3</td>
			<td>&nbsp;</td>
		</tr>
		<tr>
			<td>20</td>
			<td>25</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
		</tr>
		<tr>
			<td>10</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
		</tr>
		<tr>
			<td>15</td>
			<td>10</td>
			<td>&nbsp;</td>
			<td>5</td>
		</tr>
		<tr>
			<td>0</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
		</tr>
	</tbody>
</table>

<p>Nézd meg a szekvencia szerkeszt&otilde;t. Jobb kattintással a cellákon, írd be az új értéket a "számológépbe", a képerny&otilde;n lév&otilde; gombokra bökve, vagy a billenty&ucirc;zeten a fiókban, vagy küls&otilde; billenty&ucirc;zetr&otilde;l. Ha a cella üres akkor az null id&otilde;t jelent, vagy akkor ha az "OutFade"-kiúszási és az "InFade"-beúszási id&otilde; megegyezik. Ha a be- és kiúszási id&otilde; megegyezik, akkor nem kell megadni kiúszási id&otilde;t - csak ha különbséget akarsz köztük. Ugyanez érvényes a delay-késleltetési id&otilde;kre is.</p>

<p>A végeredmény így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_08_edit-a-sequence_final-seq-exec-sheet_v3-3_1.png" />
<figcaption><em>A szekvenciaszerkeszt&otilde; az új id&otilde;beállításokkal</em></figcaption>
</figure>

<p>Próbáld meg megnyomni a nagy 'Go+' gombot és nézd meg hogy a csatornák hogyan reagálnak a különböz&otilde; id&otilde;kre. Ezt megtalálod az onPC változatban a "Masters" résznél a jobb oldalon.</p>

<p>Nyomd meg a :&nbsp;<span class="hardkey">Backup</span>&nbsp;<span class="hardkey">Backup</span>&nbsp;(úgy mintha kett&otilde;t kattintanál az egérrel). Ez egy gyors módja a mentésnek (ugyanazon a néven).</p>

<p>&nbsp;</p>

<p>A <a href="key_09_add_moving_lights.html">következ&otilde; oldalon</a> hozzácsapunk még néhány robotlámpát.</p>

		
	</body>
</html>
