<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Képerny&otilde;k és ablakok használata</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="quick start guide - screens and windows" />
	</head>
	<body>
		
		
		<h1>Képerny&otilde;k és ablakok használata</h1>
		
		<p>Itt az ideje, hogy közelebbr&otilde;l is megnézzük, hogyan lehet a képerny&otilde;kkel és ablakokkal dolgozni.</p>

<h2>Parancssori visszajelz&otilde; ablak</h2>

<p>Gyakran felmerül&otilde; igény, hogy lássuk hogyan reagál a pult a parancsainkra. Erre kiváló lehet&otilde;ség a&nbsp;parancssori visszajelz&otilde; ablak&nbsp;.</p>

<p>Ezt fogjuk létrehozni a második képerny&otilde; (screen 2) alján (a 15,4"-es érint&otilde;képerny&otilde; a jobb oldalon).</p>

<p>Bökj valahova a bal fels&otilde; sarkában az üres képerny&otilde;nek. Ekkor megjelenik a "<strong>Create Basic Window</strong>" felugró ablak. Itt bökj a <span class="softkey">System</span> fülre. Itt megtalálod a <span class="softkey">Command Line</span> gombot. Bökj rá.</p>

<p>Most létrehoztad a&nbsp;Parancssori&nbsp;visszajelz&otilde;&nbsp;ablakot.</p>

<p>Ez folyamatosan elég sok információval áraszt el. Nem kell megijedni t&otilde;le, majd részletezzük amikor szükség lesz rá.</p>

<p>Az ablakot úgy tudod átméretezni, hogy a jobb alsó sarkán tartod a kurzort (ahol sok kis sárga pöttyöcske van, és mozgatod az ujjad/egeret. Engedd el ha tetszenek a beállítások.</p>

<p>Az ablak kisebbé tétele.</p>

<p>Ha az ablak nem foglalja el az egész képerny&otilde;t, akkor lehet mozgatni a képerny&otilde;n belül, úgy, hogy rákattintasz az ablak címsorára ( ahol a "Commnand Line Feedback" felirat van) és mozgatod az ujjad/egeret a képerny&otilde;n.</p>

<p>Mozgasd az ablakot a képerny&otilde; aljára.</p>

<h2>Csatorna táblázat</h2>

<p>Hogy az összes 40 csatornát megtekinthessük, kelleni fog egy&nbsp;Csatorna táblázat&nbsp;ablak.</p>

<p>Bökj a bal fels&otilde; sarkába a második képerny&otilde;nek. Utána válaszd ki a <span class="softkey">Sheets</span> fület a "<strong>Create Basic Window</strong>" ablakban és utána válaszd a <span class="softkey">Channel</span> gombot.</p>

<p>Sikerült a&nbsp;Csatorna táblázat létrehozása. Itt láthatóak a csatornák és azok értékei is, ha vannak.</p>

<p>Van egy pár extra csatorna is a táblázatban. "FT 1.1.1" és "FT 2.1.1" néven. Ezeket automatikusan hozza létre a software, és nem kell vele tör&otilde;dni. A részletei, a miérteknek kívül esnek ennek a leírásnak a határain.</p>

<p>A képerny&otilde;d most hasonlóan néz ki:(Ez egy csökkentett méret&ucirc; kép- kattints rá ha nagyobban is szeretnéd látni- csak az online leírásban van rá lehet&otilde;ség):</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_03_use-screens-and-windows_result_v3-3_1.png" />
<figcaption><em>Képerny&otilde; elrendezés</em></figcaption>
</figure>

<p>&nbsp;</p>

<h2>Nézetek tárolása</h2>

<p>A 2. képerny&otilde; jobb oldalán van néhány olyan hely, ahol tárolhatja az ablakainak elrendezését, a tárolt elrendezést „Nézet” -nek hívják, a 2. képerny&otilde;n a 6. képerny&otilde;számhoz tartozó jobb oldali képerny&otilde;n lév&otilde; gombok pedig „View Buttons” néven vannak.</p>

<p>Tárolhatod a nézeteket bármelyik nézet gombon.</p>

<p>A nézetet a 2. képerny&otilde; fels&otilde; nézet gombjára fogjuk elmenteni.</p>

<p>Nyomd meg a <span class="hardkey">Store</span>&nbsp;gombot, utána a&nbsp;<span class="hardkey">V1</span>&nbsp;gombot (igazi gomb a 2-es képerny&otilde; mellett). Az onPC-n nincs 'V1' gomb, tehát elég ha csak ráböksz a képerny&otilde;n a view ablakocskára.</p>

<p>A megjelen&otilde; felugró ablakban kiválaszthatod, hogy melyik képerny&otilde;ket akarod eltárolni. Mindent békén hagyva, most csak bökj a <span class="softkey">Please</span> gombra.</p>

<p>Most elkészültél egy "view 1" nev&ucirc; nézettel. Adjunk neki valami jobb nevet.</p>

<p>Nyomd meg az <span class="hardkey">Assign</span>&nbsp;gombot kétszer utána a&nbsp;<span class="hardkey">V1</span> gombot - vagy csak a view ablakocskát. Ekkor el&otilde;jön egy felugró ablak. Ide írd be:&nbsp;<span class="syntax">Channel</span>&nbsp;utána nyomj egy 'Please'/enter-t.</p>

<p>Ha megnézed a Parancssori visszajelz&otilde; ablakot akkor ez van benne:</p>

<div class="cl_response">[time] : Executing : Label ViewButton&nbsp;1.1 /screen=2</div>

<p>Ez mutatja, hogy új nevet adtál egy nézetnek ami a második képerny&otilde;höz tartozik.</p>

<p>A nézet gomb most így néz ki:</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_03_use-screens-and-windows_viewbutton_v3-2_1.png" />
<figcaption><em>Nézet gomb el&otilde;nézeti képpel</em></figcaption>
</figure>

<p>Ez egy kis kép a tárolt nézettel.&nbsp;</p>

<p>Nem számít hogy a <span class="hardkey">V1</span>&nbsp;gombot vagy a nézetablakot nyomod meg. Az eredmény ugyanaz lesz.</p>

<p>&nbsp;</p>

<p>A <a href="key_04_control_dimmers_or_channels.html">következ&otilde; oldalon</a>&nbsp;megtanuljuk a vezérlését az értékeknek a csatornákon.</p>
<p>&nbsp;</p>
		
	</body>
</html>
