<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Munka a csoportokkal</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="quick start guide - groups" />
	</head>
	<body>
		
		
		<h1>Munka a csoportokkal</h1>
		
		<p>Itt az ideje, hogy megnézzük a csoportokat.</p>

<h2>Csoport tároló</h2>

<p>Mivel néhány csoportot akarunk létrehozni, hasznos lenne ha látnánk is &otilde;ket.</p>

<p>Jó lenne ha ugyanazon a képerny&otilde;n látnánk a csoportjainkat is (akad még hely). Tehát a Csatorna listát egy sorral tegyük kissebé, és kattintsunk az üres terület bal sarkába.</p>

<p>Ismét megjelenik a "Create Basic Window"(Alapvet&otilde; ablak létrehozása) ablak. Ebben az esetben a <span class="softkey">Pools(tárolók)</span> fülre kell kattintani. Itt megtalálható a <span class="softkey">Groups(Csoportok)</span> gomb - nyomd meg. Most már látunk néhány üres csoportgombot a szemünk el&otilde;tt.</p>

<p>Ezt is elmenthetjük, mint nézet vagy az el&otilde;z&otilde;re rámenthetjük.</p>

<h2>Az els&otilde; csoport</h2>

<p>A tervünkön lév&otilde; páratlan számú lámopák meleg szín&ucirc;ek, a párosak pedig hideg szín&ucirc;ek.</p>

<p>Most ezen színek alapján fogjuk csoportosítani. Az els&otilde; az összes meleg szín&ucirc; lámpa ami frontban van FOH). Nyomd:&nbsp;<span class="hardkey">5</span>&nbsp;<span class="hardkey">+</span>&nbsp;<span class="hardkey">7</span>&nbsp;<span class="hardkey">+</span>&nbsp;<span class="hardkey">9</span>&nbsp;<span class="hardkey">+</span>&nbsp;<span class="hardkey">1</span>&nbsp;<span class="hardkey">1</span>&nbsp;<span class="hardkey">Please&nbsp;</span>. Most kiválsztottuk az 5, 7, 9 csatornát és a 11-est. Ezután nyomd&nbsp;<span class="hardkey">Store</span>&nbsp;amit az els&otilde; üres cspoortgomb követ. A csoportok nem tartalmaznak semmilyen értéket, ezért nem is kell hozzárendelni.</p>

<p>Miel&otilde;tt bármit csinálnál, használd a billenty&ucirc;zetet hogy beírd:&nbsp;<span class="syntax">FOH Warm</span>&nbsp;- ez automatikusan az utoljára "érintett" dolgonak állítja be a cimkéjét. Ha valami mást megérintettél (gombok, képerny&otilde;k, bármi) a gépelés el&otilde;tt, használhatsz más módszert a dolgok megnevezésére (például csoportok).</p>

<p>A funkció neve "Label"(cimke) és úgy férsz hozzá, hogy az 'Assign' gombot kétszer megnyomod. Csináld ezt és bökj az els&otilde; csoportra ismét. Most megint megváltoztathatod a nevet, törölheted, vagy beírhatod. Ha kész vagy akkor nyomj egy&nbsp;<span class="hardkey">Please</span>-t.</p>

<p>Nézd meg a Csatornalistádat. Itt látod ezeket a számokat 5, 7, 9 és a 11 ezeknek sárga színük van, azt jelenti, hogy még ki vannak választva. Ezzel a négy csatornával kész vagyunk, tehát nyomj egyszer egy 'Clear'-t hogy elt&ucirc;njön a kijelölés.</p>

<h2>11 további csoport</h2>

<p>Faja, mostmár mindent tudsz hogyan kell cspoortokat létrehozni. 12 csoport fog kelleni. Minden további információt a következ&otilde; táblázat tartalmaz. Az els&otilde; csoportot már megcsináltad, de a többi jó kis gyakorlat lesz.</p>

<table>
	<tbody>
		<tr>
			<th>Csoport száma:</th>
			<th>Csatornák:</th>
			<th>Név:</th>
		</tr>
		<tr>
			<td>1</td>
			<td>5 + 7 + 9 + 11</td>
			<td>FOH Warm</td>
		</tr>
		<tr>
			<td>2</td>
			<td>17 + 19 + 21 + 23</td>
			<td>LX1 Warm</td>
		</tr>
		<tr>
			<td>3</td>
			<td>25 + 27 + 29 + 31</td>
			<td>LX2 Warm</td>
		</tr>
		<tr>
			<td>4</td>
			<td>33 + 35 + 37 + 39</td>
			<td>LX4 Warm</td>
		</tr>
		<tr>
			<td>5</td>
			<td>1 + 3 + 13 + 15</td>
			<td>Box Warm</td>
		</tr>
		<tr>
			<td>6</td>
			<td>Összes páratlan szám</td>
			<td>All Warm</td>
		</tr>
		<tr>
			<td>7</td>
			<td>6 + 8 + 10 + 12</td>
			<td>FOH Cold</td>
		</tr>
		<tr>
			<td>8</td>
			<td>18 + 20 + 22 + 24</td>
			<td>LX1 Cold</td>
		</tr>
		<tr>
			<td>9</td>
			<td>26 + 28 + 30 + 32</td>
			<td>LX2 Cold</td>
		</tr>
		<tr>
			<td>10</td>
			<td>34 + 36 + 38 + 40</td>
			<td>LX4 Cold</td>
		</tr>
		<tr>
			<td>11</td>
			<td>2 + 4 + 14 + 16</td>
			<td>Box Cold</td>
		</tr>
		<tr>
			<td>12</td>
			<td>Összes páros szám</td>
			<td>All Cold</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;</p>

<p>Ha kész vagy, akkor a csoport tároló hasonlóan nézhet ki:</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_05_groups_group-pool_v3-3_1.png" />
<figcaption><em>Elkészült csoport tároló</em></figcaption>
</figure>

<p><br />
&nbsp;</p>

<p>A <a href="key_06_store_the_first_cue.html">következ&otilde; oldalon</a>&nbsp;elkészítjük az els&otilde; képünket.</p>

		
	</body>
</html>
