<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Dimmerek hozzáadása és patchelése</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="quick start guide - add and patch dimmers" />
	</head>
	<body>
		
		
		<h1>Dimmerek hozzáadása és patchelése</h1>
		
		<p>Most pedig 40 dimmer csatornát fogunk patchelni.</p>

<p>&nbsp;</p>

<p>Ebben az oktatóanyagban, egy show-t fogunk készíteni sok sok lámpával, amik sok mindent tudnak csinálni. Ezek csak virtuális lámpák így nem kerülnek semmibe sem. :-)</p>

<p>Miel&otilde;tt balettozni tudnánk, meg kell tanulni mászni, szóval kezdjük egy egyszer&ucirc; kis elrendezéssel, és néhány általános lámpával.</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_02_patch-dimmers_dimmer-plot_v3-2_1.png" />
<figcaption><em>Fényterv skiccelve</em></figcaption>
</figure>

<p>Ezen összesen 40 dimmerelt csatorna van.</p>

<h2>Lépj be a Lámpa listába</h2>

<p>Nyomd meg a&nbsp;<span class="hardkey">Setup</span>&nbsp;gombot. Érintsd meg a <span class="softkey">Patch &amp; Fixture Schedule</span> gombot.</p>

<p>Most egy felugró abalk jön el&otilde; amibe a "Layer Name" (Réteg neve)felirat van. Ide beírhatod:&nbsp;<span class="syntax">Dimmers</span>&nbsp;utána pedig nyomj egy 'Please'/enter-t.</p>

<p>A következ&otilde; dolog amit látsz az a "Fixture Wizard"(Lámpa Varázsló) - Tudom, azt gondoltad, ez egy öreg fószer, hegyes kalapban és varázspálcával. Bocsi, de nem az.</p>

<p>&nbsp;</p>

<p>A bal oldala a varázslónak így néz ki:</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_02_patch-dimmers_fixture-schedule_empty_v3-2_1.png" />
<figcaption><em>Üres lámpa varázsló</em></figcaption>
</figure>

<p>Minden zöld mez&otilde;t ki kell töltenünk, hogy hozzáadjuk a dimmereket.</p>

<p>A képerny&otilde; jobb oldalán lehet kitölteni az adatokat a zöld mez&otilde;kben. A kinézete függ attól, hogy melyik mez&otilde; aktuális a bal oldalon.</p>

<h3>Válaszd ki a lámpa típusát</h3>

<p>Gy&otilde;z&otilde;dj meg arról, hogy ki van választva az els&otilde; dolog amit ki kell tölteni. Bökj a <span class="softkey">Please select fixturetype</span>&nbsp;gombra.</p>

<p>A jobb oldalon megjelennek azok a lámpák amik benne vannak a show-ban.&nbsp;</p>

<p>Az egyik neve "2 Dimmer 00 (DMX 1)". Ez az általános dimmer ami egy DMX csatornát használ a vezérléshez.&nbsp;</p>

<p>Ez tökéletesen illeszkedik ahhoz amit akarunk, akkor bökjünk rá.</p>

<h3>Adjunk neki nevet</h3>

<p>A lápatípus kiválasztásával megváltoznak a dolgok a képerny&otilde; bal oldalán. Megváltozott a lámpa típusa arra amit kiválasztottál. Valami került a név(Name) mez&otilde;be is. Automatikusan "Dim 1" név lett beírva. Ez azt jelenti hogy a hozzáadott dimmer csatornának a neve "Dim 1" lett.</p>

<p>Amiért van szóköz a szöveg és a szám között, a következ&otilde; lámpák számozása innen fog indulni. A következ&otilde; lámpa neve "Dim 2", a harmadik "Dim 3" és így tovább.</p>

<p>Ez most egy megfelel&otilde; név lesz.</p>

<h3>Több lámpa hozzáadása egy lépésben</h3>

<p>A mez&otilde; ami bal oldalon a "Quantity" feliratot viseli.</p>

<p>Itt megadhatjuk a hozzáadandó lámpák menyiségét.</p>

<p>Írjunk:&nbsp;<span class="syntax">40</span>&nbsp;-et amit a 'Please'/enter kövessen.</p>

<h3>Lámpa és csatorna ID(azonosító)</h3>

<p>A dimmert is lámpának hívjuk akkor is ha az csak egy dimmer, vagy egy halom dimmer egy rackben valahol..</p>

<p>Minden lámpának kell egy egyedi azonosító(ID) szám, amivel kijelölhetjük a lámpát és értéket adhatunk neki.</p>

<p>Minden lámpának két ID-je lehet; egy "Fixture ID" és egy "Channel ID". Természetesen van köztük különbség. Egy lámpának lehet Fixture ID és Channel ID -je is, és ezek különbözhetnek is, de legalább egy ID számnak kell lennie közülük.</p>

<p>Ebben az oktatóanyagban a dimereknek csak ChannelID-t adunk, tehát hagyd "0"-án a FixtureID-t.</p>

<p>Azt akarjuk, hogy a dimmer az els&otilde; Channel ID-t használja. Ellen&otilde;rizd, hogy a zöld mez&otilde;ben a "Channel ID" nél 1 van írva.</p>

<p>A maradék dimmerek innen lesznek számozva.</p>

<h3>DMX patch</h3>

<p>Most meg kell mondanunk a grandMA2-nek, az els&otilde; DMX címet az els&otilde; dimmerhez. A többi növekedve innen lesz számozva..&nbsp;</p>

<p>Azt akarjuk, hogy a dimmerek kezd&otilde; DMX címe 1 legyen az els&otilde; DMX univerzumban.</p>

<p>Írd be <span class="syntax">1.001</span> utána 'Please'.</p>

<p>Ez az 1. Univerzum, egy pont, és a cím száma ami 1.</p>

<h3>Fejezd be és hagyasd jóvá</h3>

<p>Most a bal oldal így néz ki:</p>

<figure class="caption"><img alt="" src="../../../img/grandma2_quick_start_guide/qsg_02_patch-dimmers_wizard-result_v3-2_1.png" />
<figcaption><em>Az elkészült lámpa varázsló</em></figcaption>
</figure>

<p>Nyomd meg az <span class="softkey">Apply</span> gombot. Most hozzáadtál 40 dimmert a Lámpa listában.</p>

<p>&nbsp;</p>

<p>Zárd be a két beállítóablakot a nagy sárga <span class="softkey">X</span>-el. Ne aggódj a tartalom miatt, kés&otilde;bb még visszatérünk ide..</p>

<p>Egy kérdést dob fel, hogy el akarod-e menteni a változásokat. Ez azt jelenti, ha el akarjuk menteni amit itt csináltunk, akkor tegyük meg. Lécci mentsd el.</p>

<p>&nbsp;</p>

<p>A <a href="key_03_use_screens_and_windows.html">következ&otilde; oldalon</a>&nbsp;megnézzük hogyan tudjuk ezeket a csatornákat vezérelni.</p>

		
	</body>
</html>
