<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Eszközök</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="Tools tab in Sheet Options" />
	</head>
	<body>
		
		
		<h1>Tools - Eszközök</h1>
		
		<p>Az eszközök fül sok különböz&#337; beállítást tartalmaz amik ki/be kapcsolnak különböz&#337; eszközöket a lapokon. Az eszközök által hatékonyabban tudsz dolgozni.</p>

<p>Az utolsó része az opcióknak itt van leírva, szintén elérhet&#337; a <a href="key_of_sheet_options_title_buttons.html">Fejléc gomboknál</a>.</p>

<p>&nbsp;</p>

<h2>Preset Control - El&#337;beállítások Vezérlése</h2>

<p>A <strong>Preset Control</strong> egy lehet&#337;ség a csatorna, lámpa, tartalom és követ&#337; lapoknál.</p>

<p>A Preset Control ki/bekapcsolja a láthatóságát a preset Vezérl&#337;sávnak a lap alján.</p>

<p>Használható különböz&#337; presetek típusának választásához. A sáv hasonló a preset Vezérl&#337;sávhoz, ami a kódoló sávon látszik.</p>

<p>Olvashatsz róla a <a href="key_ws_preset_control_bar.html">Preset Vezérl&#337;sáv alfejezetében</a>.</p>

<div class="restriction"><strong>Korlátozások:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&#337;sáv láthatatlan.</div>

<h2>Layer Control - Réteg Vezérlés</h2>

<p>A <strong>Layer Control</strong> egy lehet&#337;ség a csatorna, lámpa, tartalom, és követés lapokon.</p>

<p>A Layer Control opció ki/bekapcsolja a Réteg Vezérl&#337;sávot a lap alján.</p>

<p>A Layer Vezérl&#337;sáv hozzáférést ad különböz&#337; adatrétegekhez a lámpákhoz.</p>

<p>B&#337;vebben a <a href="key_of_layers_in_sheets_channel_and_fixture.html">Rétegek a programozásban fejezetben</a>.</p>

<div class="restriction"><strong>Korlátozások:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&#337;sáv láthatatlan.</div>

<h2>Mask Control - Maszk vezérlés</h2>

<p>A <strong>Mask Control </strong>egy lehet&#337;ség a csatorna és lámpa lapokon.</p>

<p>A Mask Control ki/be kapcsol egy kis maszk vezérl&#337;sávot az alapvet&#337; maszkokkal.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/img_mask-control-bar_v3_3.png" />
<figcaption><em>Maszk Vezérl&#337;sáv</em></figcaption>
</figure>

<p>A maszkok a <a href="key_wfm_what_are_masks.html">Maszk fejezetben</a> vannak részletezve.</p>

<div class="restriction"><strong>Korlátozás:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&#337;sáv láthatatlan.</div>

<h2>Multi Control - Többségi vezérlés</h2>

<p>A <strong>Multi Control</strong> egy lehet&#337;ség a csatorna, lámpa és tartalom lapokon.</p>

<p>A multi control kombinálja a réteg, preset és maszk vezérl&#337;ket egy sávban három b&#337;víthet&#337; gombbal - ebben a sorrendben balról jobbra.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/img_multi-control-bar_v3_3.png" />
<figcaption><em>Multi Vezérl&#337;sáv</em></figcaption>
</figure>

<p>Az opciók elérhet&#337;ek minde gombra, pontosan úgy mint a saját vezérl&#337;sávukban.</p>

<div class="restriction"><strong>Korlátozás:</strong><br />
Ha a Multi Control be van kapcsolva, akkor a Preset Control, Layer Control, és a Mask Control rejtett lesz.</div>

<h2>ScrollBar horizontal - Görget&#337;sáv vízszintes</h2>

<p>a <strong>ScrollBar horizontal</strong> egy lehet&#337;ség a lámpa, tartalom, executor, és követ&#337; lapon.</p>

<p>Ezzel lehet ki/bekapcsolni a vízszintes görget&#337;sáv megjelenítését a lap alján.</p>

<p>A görget&#337;sáv csak akkor látszik ha szükséges.</p>

<h2>ScrollBar vertical - Görget&#337;sáv függ&#337;leges</h2>

<p>A <strong>ScrollBar vertical</strong> egy lehet&#337;ség a csatorna, DMX, lámpa, tartalom, executor, és követ&#337; lapokon.</p>

<p>Ezzel lehet ki/bekapcsolni a függ&#337;leges görget&#337;sáv megjelenítését a lap jobb oldalán.</p>

<p>A görget&#337;sáv csak akkor látszik ha szükséges.</p>

<h2><a id="link_encoders" name="link_encoders"></a>Link Encoders - Kódolók összekapcsolása</h2>

<p>A <strong>Link Encoders</strong> egy lehet&#337;ség a DMX, tartalom, executor, és követ&#337; lapokon.</p>

<p>Ha ez aktív az adott lapon (belebökve a lapba) akkor megváltozik a <a href="key_ws_encoder_toolbar.html">kódoló eszköztár</a>. Az eredmény változik a lap típusától függ&#337;en.</p>

<h3>DMX Sheet - DMX Lap</h3>

<p>A kódoló átváltozik DMX tesztel&#337;vé. Olvass róla b&#337;vebben a <a href="key_patch_dmx_testing.html"> DMX tesztelése fejezetben</a>.</p>

<h3>Content Sheet and Tracking Sheet - Tartalom Lap és Követ&#337; Lap</h3>

<p>A kódoló átváltozik Executor Eszköztárrá. Olvass róla b&#337;vebben a <a href="key_exec_what_are.html">mik azok az executorok fejezetben</a>.</p>

<h3>Executor Sheet - Executor Lap</h3>

<p>Ez egy kicsit el van rejtve mint opció az executor lapon. Hozzá kell adnod mint <a href="key_of_sheet_options_title_buttons.html">fejléc gomb </a> a be/kikapcsoláshoz.</p>

<p>Ez is megnyitja az Executor Eszköztárat. Kövesd a linket a "Tartalom Lapnál" feljebb az egyéb információkért.</p>

<h2><a id="edit_cueonly" name="edit_cueonly"></a>Edit CueOnly - Csak a kép szerkesztése</h2>

<p>Az <strong>Edit CueOnly</strong> egy lehet&#337;ség a tartalom és követ&#337; lapokon.</p>

<p>Ha ez a z opció <strong>on</strong>, minden változás amit a lapon elkövetsz Cue Only módon lesz tárolva. Az értékek szerkesztésér&#337;l e két lapon, a <a href="key_cs_cue_content.html">Nézzünk bele a kép tartalmába fejezetben</a> olvashatsz.</p>

<h2>DMX Readout Absolute - DMX kiolvasása abszolút értékben</h2>

<p><strong>DMX Readout Absolute</strong> egy lehet&#337;ség a DMX lapon.</p>

<p>Ez az opció lehet&#337;vé teszi, hogy a DMX címeket abszolút, vagy elkülönült értékként nézd az univerzumban.</p>

<p>Ha az Absolute kiolvasás van beállítva, akkor csak egy számként jelenik meg az érték. Ez azt jelenti, hogy a DMX értékek folyamatosan növekv&#337; számokként jelennek meg. Az els&#337; DMX szám a második univerzumban 513 lesz. (512 az els&#337; univerzumból plussz 1).</p>

<p>Ha a Separated kiolvasás van beállítva, akkor a lapon két szám jelenik meg egy ponttal elválasztva. Az els&#337; szám az univerzum száma, a második pedig a DMX cím lesz ebben az univerzumban.</p>

		
	</body>
</html>
