<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Timcode show szerkesztése</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="timecode show - edit, timecode editor, track functions, timecode show options" />
	</head>
	<body>
		
		
		<h1>Timcode show szerkesztése</h1>
		
		<p>A Timcode show szerkesztése megnyitja a <strong>Timecode Szerkeszt&#337;</strong> ablakocskát.</p>

<p>&nbsp;</p>

<h2>Timecode Show Szerkeszt&#337;</h2>

<p>A szerkeszt&#337; így fest:</p>

<figure class="caption"><img alt="" src="../../img/popup_edit-timecode_graphic-style_v3-3.png" />
<figcaption><em>Timecode szerkeszt&#337; ablakocska - Grafikus stílus</em></figcaption>
</figure>

<p>Két módja van amit a jobb oldali gombokkal lehet megváltoztatni. Az egyetlen különbség a <a href="#main_part">F&#337; részben van</a>. Felette van a <strong>Graphic(grafikus)</strong> stílus. Alul a <strong>Szöveges(text)</strong> stílus:</p>

<figure class="caption"><img alt="" src="../../img/popup_edit-timecode_text-style_v3-3.png" />
<figcaption><em>Timecode szerkeszt&#337; ablakocska - Szöveges stílus</em></figcaption>
</figure>

<h3>Címsor</h3>

<p>A címsor bal oldalán a szokásos sárga golyó van ami megnyitja a <strong>Beállításokat</strong>. Balról jobbra haladva, a következ&#337; a neve és a száma a timecode- shownak. itt van egy rész ami a lejátszási állapotot mutatja (Stop, Play, Pause, és Record ikonok) és az aktuális id&#337;t. Ha itt egy "+" van az id&#337; el&#337;tt, akkor offszet lett hozzáadva.</p>

<p>Utána van három gomb a zoom beállításaihoz a grafikus nézetben. Az els&#337; kett&#337; zoom gomb (balról) a normal zoom be és ki. A következ&#337; az egész felvett timecode showt mutatja.</p>

<p>A következ&#337; "zoom" gomb egy kapcsoló <strong>Follow Time</strong>néven. Ha aktív, akkor a kijelz&#337;n mindig látszik az aktív kép vagy id&#337;. Olyan mint az <strong>Auto Scroll</strong> az oldalakon. Mozgatja a zöld jelöl&#337;t és vonalat balról középre amikor egy show felvev&#337;dik, vagy lejátszás alatt van.</p>

<p>Az utolsó két gomb, a szokásos ami a szerkeszt&#337;t áthelyezi egy másik képerny&#337;re, és a nagy X ami bezárja az ablakot.</p>

<p>Emlékezz, ha a szerkeszt&#337; az 1. képerny&#337;n van akor a jobb oldali és a lenti gombok, használhatóak az U- és X- gombokkal. Mindig lehetséges a képerny&#337;n lév&#337; gombokat is böködni.</p>

<p>&nbsp;</p>

<h3>Jobb oldali gombok</h3>

<p>Mint már utaltunk rá fent, van két gomb a jobb oldalon amivel a szerkeszt&#337; megjelenését lehet befolyásolni a <strong>Graphic(grafikus)</strong> és <strong>Text(szöveges)</strong> mód között.</p>

<p>A <strong>Label</strong> gomb megnyitja a <strong>Enter Name ablakocskát</strong> ahol ellehet nevezni a timecode show -nkat.</p>

<p>&nbsp;</p>

<h3>Alsó gombok</h3>

<p>Az alsó részen sok gomb van, amivel szerkeszteni és vezérelni lehet a timecode show-t. Három részre van osztva, három szakaszban: Direct Tools(direkt eszközök), Track Tools(sáv eszközök), és Playback Controls(lejátszási eszközök).</p>

<p><strong>Direct Tools:</strong></p>

<p>Ezekre a gombokra bökve, lehet másolni/beilleszteni, kijelölni és törölni az eseményeket.</p>

<ul>
	<li><strong>Add Here(hozzáadás itt)</strong>:<br />
	Egy eseményt ad az aktuális képkockához. Ha már van itt valami akkor a következ&#337; képkockához adja. Nem hozza létre az eseményt, ha itt és a következ&#337; képkockán is van valami. Automatikusan hozzáad egy Goto next cue-t, vagy insert markert az aktuális húzó pozíciójához.</li>
	<li><strong>Add Multiple(többszörös hozzáadás)</strong>:<br />
	Ez megnyitja a <strong>Create Multiple Events ablakocskát</strong>.
	<figure class="caption"><img alt="" src="../../img/popup_create-multiple-events_v3-3.png" />
	<figcaption><em>Többszörös esemény létrehozása ablakocska</em></figcaption>
	</figure>
	<br />
	Itt több mint egy eseményt tudsz hozzáadni, egyid&#337;ben. Állítsd be az <strong>Number of Events</strong>(Események számát) ahogy akarod. Állíts be egy <strong>Interval</strong>(id&#337;közt) vagy egy <strong>Overall Timespan</strong>(id&#337;tartam összességet) - ezek össze vannak kapcsolva az események számával. Végül állítsd be az els&#337; képet az eseménynek. A következ&#337; képek az események számától függ&#337;en adódnak hozzá. Ha nincs elég kép, a szekvencia ismétl&#337;dik és újra az els&#337; kép lesz felülr&#337;l használva.</li>
	<li><strong>Delete Selected(Kijelölt törlése)</strong>:<br />
	Minden kijelölt eseményt töröl.</li>
	<li><strong>Manual Record(Kézi felvétel)</strong>:<br />
	Ez a funkció jelenleg nem elérhet&#337;.</li>
	<li><strong>Clear Selection(Kijelölés törlése)</strong>:<br />
	Ez törli az összes kijelölést az eseményeken.</li>
	<li><strong>Create Selection(Kijelölés készítése)</strong>:<br />
	Ez megnyitja a <strong>Create Selection ablakocskát</strong>.
	<figure class="caption"><img alt="" src="../../img/popup_create-selection_v3-3.png" />
	<figcaption><em>Kijelölés készítése ablakocska</em></figcaption>
	</figure>
	<br />
	Itt több eseményt is ki tudsz jelölni. A baloldali legördül&#337; listában kiválaszthatod, hol jöjjön létre a kijelölés <strong>On Current Subtrack(Az aktuális alsávon)</strong>, <strong>On Selected Tracks(A kiválasztott sávokon)</strong>, vagy <strong>On All Tracks(Az összes sávon)</strong>. A következ&#337; három gomb lehet&#337;vé teszi az összes esemény kiválasztását <strong>Before(el&#337;tte)</strong> (és tartalmazva) az id&#337; jelöl&#337;t, <strong>All(összes)</strong> eseményt, vagy az összeset <strong>After(utána)</strong> (és tartalmazva) az id&#337; jelöl&#337;t.</li>
	<li><strong>Copy Events(események másolása)</strong>:<br />
	Erre a gombra bökve, kimásolódnak a kijelölt események. Ez átmásol minden eseményt, a kiválasztott sávból, ha nincs más kiválasztott esemény. Lehetséges több esemény kijelölése különböz&#337; sávokból is.</li>
	<li><strong>Paste Events(események beilleszése)</strong>:<br />
	Ez a gomb beilleszti a kimásolt eseményeket az aktuális id&#337; jelöl&#337;nél. ha egész sáv lett másolva, akkor eltolja a sáv kezdését az aktuális id&#337; jelöl&#337;t&#337;l. ha több sávot másoltál akkor azokat, különálló új sávokra illeszti be.</li>
</ul>

<p>&nbsp;</p>

<p><strong>Track Tools(Sáv eszközök):</strong></p>

<p>Ezek a gombok szabályozzák, hogyan játszódnak vissza a sávok és itt lehet kézzel hozzáadni, vagy törölni sávokat.</p>

<ul>
	<li><strong>Activate All Tracks(Minden sáv aktiválása)</strong>:<br />
	Ez minden sávot megmutat a <strong>Szöveges</strong> módjában a szerkeszt&#337;nek.</li>
	<li><strong>Sort Tracks(Sávok rendezése)</strong>:<br />
	Ez lehet&#337;vé teszi a sávok rendezését szám szerinti sorban. Az inaktív sávok a lista aljára kerülnek.</li>
	<li><strong>Deactivate All Tracks(összes sáv deaktiválása)</strong>:<br />
	Ez elejti az összes sávot a <strong>Szöveges</strong> módjában a szerkeszt&#337;nek(a felvett események végrehajtódna).</li>
	<li><strong>Track Functions(Sáv funkciók)</strong>:<br />
	Ez megnyitja a <strong>Track Functions ablakocskát</strong>. ez az ablakocska, megnyithat másik ablakocskákat és bonyolultabb dolgokat is végre lehet vele hajtani. Olvass további részleteket a sáv funkciójáról <a href="#track_functions">lejebb</a>.</li>
</ul>

<p>&nbsp;</p>

<p><strong>Playback Controls:(lejátszás vezérlése)</strong></p>

<p>Ezek a gombok vezérlik a lejátszási és felvételi állapotát a timecode shownak.</p>

<ul>
	<li><strong>Rewind (to the beginning)(visszatekerés(az elejére))</strong>:<br />
	Visszaáll a 0 (zéró) id&#337;re.</li>
	<li><strong>Stop(Állj)</strong>:<br />
	Megállítja a show futó/lejátszását vagy felvételét.</li>
	<li><strong>Record(felvétel)</strong>:<br />
	felveszi a show-t az aktuális id&#337;t&#337;l. Ha visszatekert shownál indítjuk el újra akkor, további akciókat vehetünk fel a showba. Nem fogja törölni az el&#337;z&#337;leg felvett akciókat.</li>
	<li><strong>Pause(pillanatállj)</strong>:<br />
	Iediglenesen megállítja a futó/felvett id&#337;t az aktuális pontnál.</li>
	<li><strong>Forward (to the end)(el&#337;reugrás(a végére))</strong>:<br />
	Az id&#337; jelöl&#337;t a show végére viszi.</li>
	<li><strong>Play(Lejátszás)</strong>:<br />
	Lejátssza a timecoed showt. Olvass róla a <a href="key_timecode_playing.html">Timecode Show visszajátszása fejezetben</a>.</li>
</ul>

<p>&nbsp;</p>

<h3><a id="track_functions" name="track_functions"></a>Sáv funkciók</h3>

<p>A sáv funkciói megnyílnak a <span class="softkey">Track Functions</span> gombra bökve. Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/popup_track-functions_v3-3.png" />
<figcaption><em>Track Functions ablakocska</em></figcaption>
</figure>

<p>Nyolc különböz&#337; gomb van itt:</p>

<ul>
	<li><strong>Expand All Tracks(Minden sáv kinyitása)</strong>:<br />
	Ez kinyitja az összes al-sávot a timecode showban.</li>
	<li><strong>Collapse All Tracks(Minden sáv összecsukása)</strong>:<br />
	Ez összecsukja (elerjti) az összse al-sávot a timecode showban.</li>
	<li><strong>Change Executor/Fader(Executor/húzó megváltoztatása)</strong>:<br />
	Ezt megnyomva a <strong>válassz executort a létez&#337; track-hoz ablakocskához</strong>jutunk. Így néz ki:
	<figure class="caption"><img alt="" src="../../img/popup_select-executor-for-existing-track_v3-3.png" />
	<figcaption><em>Select Executor for Existing Track ablakocska</em></figcaption>
	</figure>
	<br />
	Itt az egyik létez&#337; executort kiválaszthatod a kiválasztott timecode sávnak.</li>
	<li><strong>Lock/Unlock Track(sáv lezárás/feloldás)</strong>:<br />
	Ez lezárja/engedélyezi a f&#337; ÉS al-sávokat. A lezárt sávkoon sárga lakat ikon jelenik meg.</li>
	<li><strong>Lock/Unlock Sub Track(al-sáv lezárás/feloldás)</strong>:<br />
	Ez lezárja/feloldja, csak a kiválasztott sávot/al-sávot. Vigyázz, egy al-sáv lezárható mnid a két módszerrel. A lezárt al-sávokon sárga lakat ikon jelenik meg..</li>
	<li><strong>Add New Track(Új sáv hozzáadása)</strong>:<br />
	Ez megnyitja a <strong>Select executor for new track ablakocskát</strong>. Ez pontosan úgy néz ki mint a <strong>Select executor for existing track ablakocska</strong> mint fent.<br />
	Itt a sáv kiválasztható az executorok listájából. A kiválasztott executor felkerül a sávok listájára mint új sáv..</li>
	<li><strong>Add New Sub Track(Új al-sáv hozzáadása)</strong>:<br />
	Ez megnyitja s <strong>Select New Sub Track ablakocskát</strong>.
	<figure class="caption"><img alt="" src="../../img/popup_select-new-sub-track_v3-3.png" />
	<figcaption><em>Select New Sub Track ablakocska</em></figcaption>
	</figure>
	<br />
	Itt kiválaszthatsz egy húzó funkciót ami új al-sávként adódik hozzá a timecode showhoz.</li>
	<li><strong>Delete Current (Sub) Track(aktuális al-sáv törlése)</strong>:<br />
	Ez törli a sávot. Ha az aktuális sáv af&#337; sáv, akkor az al-sávjai is törl&#337;dnek.</li>
</ul>

<p>&nbsp;</p>

<h3><a id="main_part" name="main_part"></a>F&#337; rész</h3>

<p>A <strong>Timecode Editor</strong> f&#337; részén található egy id&#337;sáv a fels&#337; részen. Egy zöld jelöl&#337; mutatja az aktuális pozíciót. Ennek nem lehet negatív értéke - mert az timecode sem lehet negatív érték&ucirc;.</p>

<p>A bal olali kis részben látszódnak a különböz&#337; sávok. Van legaláb egy sáv aminek minden executor akciója megvan (gomb nyomás és elengedés). A fú sávot sötét háttérrel mutatja. Ott van az executor száma a fels&#337; vonalban, és a szekvencia száma és neve a következ&#337; vonalban. Lejjebb vannak a lehetséges al-sávok. Az al-sávok a húzó mozgást tartalmazzák. Az executor megváltoztatható a <a href="#track_functions">Track Functions</a> vagy az <span class="hardkey">Edit</span> gomb és egy sávra kattintással (vagy jobb kattintással a sávon), ezzel megnyílik az ablakocska, ahol kiválasztható egy új executor vagy al-sáv típus.</p>

<p>Az egyes f&#337; sávok melletti bal oldalon négy különböz&#337; szimbólum látható. Az egyik egy kicsi négyzet plusz/mínusz jelöléssel. Ez kinyitja/összecsukja az aktuális sáv al-sávjait. Van egy kis négyzet is, amelyen vagy egy kis pipa van, vagy üres. Ez megjeleníti vagy elrejti a sávot a szerkeszt&#337; <strong> Szöveges </strong> módjában. Aztán ott van a kis „lejátszás” ikon. Ha ennek van egy letiltott szimbóluma, akkor ezt a sávot és az al-sávot a show lejátszásakor nem hajtja végre. Az utolsó ikon egy "rekord" ikon. Ha ez letiltotta a szimbólumot, akkor ez a sáv és az alsáv nem változik a felvétel során. Ezeket az ikonokat koppintással megváltoztathatod. </p>

<p>A maradék része a f&#337; oldalnak, a választott módtól függ.</p>

<h3>Graphic Mode(grafikus mód)</h3>

<p> Grafikus módban vannak olyan sávok, amelyek kiterjednek az executor számával és (ha kib&#337;vített) a húzókkal rendelkez&#337; területekt&#337;l. Az események különböz&#337; szimbólumokkal jelennek meg. </p>

<figure class="caption"><img alt="" src="../../img/popup_edit-timecode_graphic-style_detail_v3-3.png" />
<figcaption><em>Timecode Szerkeszt&#337; ablakocska - F&#337; rész grafikus módon</em></figcaption>
</figure>

<p> A fenti kép a kib&#337;vített sávot mutatja. A fels&#337; sor a különböz&#337; események néhányát mutatja. Az al-sáv sorai a húzó mozgását jelenítik meg. Az összes esemény szerkeszthet&#337; az egér jobb gombbal történ&#337; kattintásával. </p>

<p> A zöld függ&#337;leges vonal mutatja az aktuális id&#337;t. A hálózati munkamenetek minden id&#337;kódjának egy id&#337;jelz&#337;je van. Ha a <strong> Követés ideje(Follow Time) </strong> aktiválva van (a címsorban), akkor a f&#337; m&ucirc;sorszám utoljára lejátszott m&ucirc;veletét automatikusan kiválasztja a lejátszás során. Ha az id&#337;kód forrása a bels&#337; forrás, akkor az id&#337; szünetel, ha a 4. (jobb széls&#337;) kódolót elforgatják, és ez mozgatja az utolsó esemény helyzetét is. </p>

<p> A fels&#337; sor szimbólumai különböznek a m&ucirc;veletekt&#337;l. Az egyes szimbólumok melletti szám a cue szám. Lehet, hogy van egy szöveg, ez a kép neve. </p>

<p>Jobb gombbal kattintásra megnyílik a <strong>Event Command ablakocska</strong>.</p>

<figure class="caption"><img alt="" src="../../img/popup_event-command_v3-3.png" />
<figcaption><em>Esemény Parancs ablakocska</em></figcaption>
</figure>

<p>Itt kiválaszthatod a különböz&#337; akciókat az eseményhez.</p>

<div class="important"><strong>Fontos:</strong><br />
Esemény, amikor a felvétel közben megnyomod a <strong> Go </strong> gombot, akkor a tárolt m&ucirc;velet valójában <strong> Goto </strong> m&ucirc;velet. Ennek célja annak ellen&#337;rzése, hogy a rögzített képet játssza-e vissza. </div>

<h3>Text Mode</h3>

<p>A szöveges módban a f&#337; rész eképpen néz ki:</p>

<figure class="caption"><img alt="" src="../../img/popup_edit-timecode_text-style_detail_v3-3.png" />
<figcaption><em>Timecode Editor ablakocska - F&#337; rész Szöveges módban</em></figcaption>
</figure>

<p>Itt az események táblázatszer&ucirc;en néznek ki. 5 oszlop van itt:</p>

<ul>
	<li><strong>Time(id&#337;)</strong>:<br />
	Ez mutatja az idejét az akciónak vagy parancsnak.</li>
	<li><strong>Exec</strong>:<br />
	Ez a szekvencia neve és az executor száma.</li>
	<li><strong>Command(parancs)</strong>:<br />
	Ez a végrehajtódó parancs vagy akció.</li>
	<li><strong>Value(érték)</strong>:<br />
	Az érték a kép száma vagy a húzó pozíciója ami kapcsolva van a parancshoz/akcióhoz.</li>
	<li><strong>Timing Overwrite(id&#337;zítés felülírás)</strong>:<br />
	Egy érték itt megnyitja a <strong>Számológép ablakocskát</strong>. Ez használható új érték beírásához, amit az <strong>átúszási</strong> id&#337; a kép akciókhoz ellentétben a máshol eltárolt id&#337;kkel.<br />
	Ez felülírja a tárolt kép id&#337;ket. Minden késleltetési id&#337; 0-ra lesz állítva és a különböz&#337; id&#337;k pedig kihagyva. Ez minden kép részére vonatkozik.</li>
</ul>

<p>Minden sor egy esemény a timecode show-ban. A világosszürke háttérrel rendelkez&#337; sorok a kiválasztott sáv eseményei. A zöld háttérrel rendelkez&#337; sor a kiválasztott esemény. A sötétebb szürke szín&ucirc; sorok nem a kiválasztott sáv eseményei. </p>

<p> Az utolsó végrehajtott esemény automatikusan kiválasztásra kerül, amikor a show fut. Ha az id&#337;forrás a bels&#337; óra, és a 4. kódolót lejátszás közben elforgatják, akkor az id&#337; automatikusan szünetel, és a kiválasztott esemény átkerül. </p>

<p> Minden, amely nem rendelkezik nagyon sötétszürke háttérrel, szerkeszthet&#337;. A cella szerkesztése ablakocskát nyit meg, amellyel szerkesztheti az értékeket. Például egy kép érték cellájának szerkesztésével megnyílik a <strong> Kép kiválasztása el&#337;ugró ablak </strong>. Ez így néz ki: </p>

<figure class="caption"><img alt="" src="../../img/popup_select-cue_v3-3.png" />
<figcaption><em>Válassz képet ablakocska</em></figcaption>
</figure>

<p>Itt lehet egy másik képet választani.</p>

<p>Az oszlopokat sorba rendezheted, ha ráböksz az oszlop fejlécére és le vagy felfelé elmozdítod. Ez rendezi az oszlopokat, növekv&#337; vagy csökken&#337; sorrendben, amit egy kis nyilacska is mutat.</p>

<p>&nbsp;</p>

<h2><a id="timecode_show_options" name="timecode_show_options"></a>Timecode Show Opciók</h2>

<p>A sárga golyóra bökve a bal fels&#337; sarokban, megjelennek a <strong>Timecode Szerkeszt&#337;</strong> beállításai:</p>

<figure class="caption"><img alt="" src="../../img/popup_timecode-options_v3-3.png" />
<figcaption><em>Timecode Options ablakocska</em></figcaption>
</figure>

<p>Itt egy rövid leírás az opciókról:</p>

<ul>
	<li><strong>Name:</strong><br />
	Itt a neve az éppen szekesztett timecode shownak.</li>
	<li><strong>Slot:</strong><br />
	Ide bökve megnyílik a <strong>Select Timecode Slot ablakocska</strong>. Itt kiválaszthatod, hogy a timecode forrása a bels&#337;, a kiválasztott slot, vagy a 8 fix közül legyen valamelyik. Az ablak így néz ki:
	<figure class="caption"><img alt="" src="../../img/popup_select-timecode-slot_v3-3.png" />
	<figcaption><em>Select Timecode Slot ablakocska</em></figcaption>
	</figure>
	</li>
</ul>

<ul>
	<li><strong>Length:</strong><br />
	A show teljes hossza.</li>
	<li><strong>Offset:</strong><br />
	Lehet&#337;vé teszi (pozitív irányban) az egész timecode show eltolását id&#337;ben. Például hozzáadhatsz egy órát, anélkül, hogy mozgatni kéne az eseményeket.</li>
	<li><strong>Runs:</strong><br />
	Ezt akkor használhatod, ha bels&#337; timecode forrás van beállítva. Akkor a timecode show-t lehet ismételni, ahányszor jól esik, vagy végtelenítve tudod lejátszani (ameddig kézzel meg nem állítod).</li>
	<li><strong>Switch Off</strong>:<br />
	Két opciója van: <strong>Playback Off</strong>(lejátszás ki) vagy <strong>Keep Playbacks</strong>(Lejátszás folytatása). Ez megmondja mi történjen a lejátszással (amiket a timecode show indított), akkor ha a timecode show kikapcsolódik.</li>
	<li><strong>Status Call(Állapot hívás)</strong>:<br />
	Amikor az <strong>Status Call</strong> bekapcsolva van, akkor a timecode show szinkronizálódik a timecode jellell azonnal. Ha ki van kapcsolva akkor, elindul amikor az eseményt eléri. Például: A timecode show-t akkor indítod amikor az id&#337; a "Goto Cue 1" és a "Goto Cue 2"között áll. Ha a <strong>Status call Be</strong>, a Goto Cue 1 azonnal végrehajtódik - ez az állapot, amelyet feltételezzük, hogy az id&#337;kód-mutató rendelkezik. Ha <strong>Status Call Off</strong>, nem futattja a 1. képet, hanem megvárja ameddig eléri a "Goto Cue 2" eseményt.</li>
	<li><strong>Time unit(Id&#337; egység)</strong>:<br />
	Ha megnyomod megnyílik a <strong>Select Time Unit ablakocska</strong>. Így fest:
	<figure class="caption"><img alt="" src="../../img/popup_select-time-unit_v3-3.png" />
	<figcaption><em>Select Time Unit ablakocska</em></figcaption>
	</figure>
	<br />
	Itt a megjelenített id&#337; egységét lehet kiválasztani. Az opciók: <strong>1/100 Sec.</strong>, <strong>30 FPS</strong>, <strong>25 FPS</strong>, vagy <strong>24 FPS</strong>. Ez nem függ a bejöv&#337; timecode jelt&#337;l. Ez csak a grafikus megjelenítésben látszik. (FPS = képkocka per másodperc).</li>
	<li><strong>When Ending(szerkesztés közben)</strong>:<br />
	Két külön opciója van: <strong>Stop</strong> vagy <strong>Pause</strong>. Ez meghatározza, hogy mi történjen ha a timecode show kifut a felvett id&#337;b&#337;l. Ez a beállítás nem számít a küls&#337; timecode forrás használatánál!</li>
	<li><strong>When Stopping</strong>:<br />
	Két külön opciója van: <strong>Do Nothing(semmit nem csinál)</strong> vagy <strong>Rewind(visszatekerés)</strong>. Ez megmondja mi történjen ha a timecode show le lesz állítva.</li>
	<li><strong>Autostart</strong>:<br />
	Ez vagy <strong>On</strong> vagy <strong>Off</strong> lehet. A timecode show elindul magától, ha a forrás fut. Ez az opció nem elérhet&#337; ha bels&#337; id&#337;forrást használsz.</li>
	<li><strong>User Bits</strong>:<br />
	A 32 bites nyolc számjegy&ucirc; id&#337;kód mellett az id&#337;kód keretenként 32 <strong> User Bits </strong> (8 számjegy) végrehajt. A Felhasználói bitek segítségével jelölje ki az id&#337;kód jelét. Használhatsz például az 1. felhasználói bitet a fény, a 2. felhasználói bitet a pyro számára. Ez nem érhet&#337; el bels&#337; id&#337;kód-forrás használatakor. Ne változtasd meg, hacsak az id&#337;kód-szolgáltató kifejezetten nem kéri. </li>
	<li><strong>Info</strong>:<br />
	Itt lehet némi információt hozzáadni a timecode show-hoz.</li>
</ul>

<p>&nbsp;</p>

<p>Ezeket az opciókat bezárhatjuk, ha rábökünk a sárga "x" re a jobb fels&#337; sarokban.</p>

		
	</body>
</html>
