<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Time Control - Id&otilde; Vezérlés</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="Time Control, Program Time, Exec Time, Executor Time" />
	</head>
	<body>
		
		
		<h1>Time Control - Id&otilde; Vezérlés</h1>
		
		<p>Az id&otilde;vezérlés a kódoló sávtól jobbra található a 2. képerny&otilde;n.</p>

<p>Ez egy két-húzós vezérl&otilde;, amivel különböz&otilde; id&otilde;zítést lehet vezérelni. Ezeket <strong>Program Id&otilde;</strong> és <strong>Exec Id&otilde;</strong> (Executor Id&otilde;nek) hívjuk.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/img_time-control_3_3.png" />
<figcaption><em>Id&otilde; Vezérlés</em></figcaption>
</figure>

<p>A húzókat bármelyik Húzó Executorhoz hozárendelhetjük. Ez fizikai húzóvezérlést tesz lehet&otilde;vé. Olvasd el ezeket is a<a href="key_adv_exec_spec_master_grand.html">Grand Masters fejezetben</a>.</p>

<p>A két húzóval lehet id&otilde;ket beállítani. Az alapérték maximuma 10 másodperc. Ezt a maximumot lehet állítani a  Setup-&gt;User-&gt;<a href="key_single_multi_systems_user_settings.html#settings">Beállításoknál</a>.</p>

<p>A 2. képerny&otilde; alja megváltoztatható a grandMA2 onPC-ben. Ez hozzáigazítja a grandMA2 onPC Command Wing hardveréhez. Ez elrejti az Id&otilde; Vezérlést. Olvasd el a <a href="key_onpc_details.html">grandMA2 onPC részletek fejezetet</a> a további részletekr&otilde;l.</p>

<p>A húzókat hozzárendelheted fizikai húzókhoz is.</p>

<p>A virtuális vezérlést bármelyik képerny&otilde;re kiteheted, a <strong>CMD Section ablak</strong>használatával. Ezt megtalálod az <strong>Other</strong> fülön az <a href="key_windows.html">Alapvet&otilde; Ablakok készítése ablakocskában</a>.</p>

<p>&nbsp;</p>

<h2><a id="program_time" name="program_time"></a>Program Id&otilde;</h2>

<p>A Program Time felhasználható arra, hogy elhalványulási id&otilde;t adj hozzá a programozó értékeinek változásaihoz. Állítsd a húzót a kívánt értékre, és aktiváld a programid&otilde;t az On gomb megnyomásával, vagy bökj az <span class = "softkey">Set Time</span> gombra, hogy pirosra váltson. A beállított id&otilde;t minden értékváltoztatáshoz felhasználjuk a programozóban. </p>

<p>A kikapcsoláshoz bökj a <span class="softkey">Set Time</span> gombra ismét vagy nyomd meg az Off executor gombot. A piros jelölés elt&ucirc;nik.</p>

<p> Az is lehetséges, hogy a húzót kézi átúsztatáshoz használjuk a régi értékekt&otilde;l az új értékekig. Bökj a <span class = "softkey"> Manula Xfade </span> gombra, vagy nyomd meg az MFX végrehajtó gombot az átúsztatás aktiválásához - zöld lámpácska jelzi. A húzó a legalacsonyabb helyzetbe kerül (ha még nincs ott). Változtasd meg az értéket az új értékekre - a kimenet nem változik! Állítsd a húzót a legalacsonyabbról a legmagasabbra, hogy elhalványuljon az új értékekbe. A zöld fény villog, miközben az átúsztatás aktív. </p>

<p>Bökj rá ugyanarra a gombra, hogy deaktiváld a kéz átúsztatás lehet&otilde;ségét - a zöld lámpácska kialszik.</p>

<p>&nbsp;</p>

<h2><a id="exec_time" name="exec_time"></a>Exec Time (Executor Id&otilde;)</h2>

<p> Az Exec id&otilde; felhasználható egy eltér&otilde; átúsztatási id&otilde; hozzáadásához a kép változásakor. Állítsd a húzót-t a kívánt értékre, és aktiváld az Exec Time -ot  az On gomb megnyomásával, vagy bökj rá a <span class = "softkey"> Set Time </span> gombra, hogy piros legyen. Most minden kép megváltoztatja az értékeket a beállított id&otilde;vel. A késést és az egyes id&otilde;ket figyelmen kívül hagyja. A Követés vagy az Id&otilde; kiváltó jelek felhasználják a tárolt id&otilde;t. </p>

<p>A kikapcsoláshoz bökj a <span class="softkey">Set Time</span> gombra ismét vagy nyomd meg az Off executor gombot. A piros jelölés elt&ucirc;nik.</p>

<p> Az is lehetséges, hogy a húzót kézi átúsztatáshoz használjuk a régi értékekt&otilde;l az új értékekig. Bökj a <span class = "softkey"> Manula Xfade </span> gombra, vagy nyomd meg az MFX végrehajtó gombot az átúsztatás aktiválásához - zöld lámpácska jelzi. A húzó a legalacsonyabb helyzetbe kerül (ha még nincs ott). Változtasd meg az értéket az új értékekre - a kimenet nem változik! Állítsd a húzót a legalacsonyabbról a legmagasabbra, hogy elhalványuljon az új értékekbe. A zöld fény villog, miközben az átúsztatás aktív. </p>

<p>Bökj rá ugyanarra a gombra, hogy deaktiváld a kéz átúsztatás lehet&otilde;ségét - a zöld lámpácska kialszik.</p>

<p>Az Executor beállítható, arra, hogy átugorja az Exec Time-ot. Ezt megteheted az <a href="key_adv_exec_options.html">Executor Opcióknál</a>. Ett&otilde;l az Executor a normál beállításokkal, a tárolt kép id&otilde;zítésekkel fog futni.</p>

		
	</body>
</html>
