<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Segítség kérése az MA Technikai Támogatástól</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="Technical Support, Support, Service" />
	</head>
	<body>
		
		
		<h1>Segítség kérése az MA Technikai Támogatástól</h1>
		
		<p>Ha a grandMA2 nem a leírtaknak megfelel&otilde;en m&ucirc;ködik, a következ&otilde;ket teheted:</p>

<ul>
	<li><strong>Hibaüzenet</strong>: Nem tudsz eljutni a leírtak szerinti következ&otilde; lépéshez, és hibaüzenetet kapsz:<br />
	Nézd át a &nbsp;<a href="key_error_messages.html">Hibaüzenetek oldalt </a> és próbáld meg mégegyszer.<br />
	Ha a probléma fennáll, értesítsd a technikai segítséget.</li>
	<li><strong>A rendszer nem m&ucirc;ködik:</strong> Nem tudsz eljutni a leírtak szerinti következ&otilde; lépéshez, és nem kapsz hibaüzenetet:<br />
	Értesítsd a technikai segítséget és írd le az utolsó lépést amit elkövettél.</li>
</ul>

<h2> Technikai Szolgáltatás és Támogatás</h2>

<p> Az MA Lighting és kiterjedt forgalmazói hálózata páratlan m&ucirc;szaki szolgáltatást kínál. <br />
Hívjon segítséget szakért&otilde;nkt&otilde;l bármilyen probléma esetén, függetlenül attól, hogy a m&ucirc;ködés, a szoftver funkciói, a szoftver telepítése vagy a hibaelhárításra vonatkozik-e. <br />
<br />
Kérjük, küldjön egy e-mailt (angol vagy német nyelven) a m&ucirc;szaki ügyfélszolgálatnak az elérhet&otilde;ségeivel és a m&ucirc;szaki kérdéssel együtt. Lásd a m&ucirc;szaki támogatás e-mail címét a weboldal alján. <br />
Ezt az e-mail szolgáltatást a MA Lighting németországi munkaid&otilde;ben, hétf&otilde;t&otilde;l péntekig 8.30-tól 17-ig 17 óráig figyeli. <br />
<br />
<strong> A sürg&otilde;sségi szolgáltatásokkal kapcsolatban kérjük, forduljon a helyi MA forgalmazóhoz vagy az MA Lighting Service forródróthoz. <br />
Hívja: +49 5251 688865-99. Felhívjuk figyelmét, hogy ez egy 24 órás ügyfélszolgálat, amelyet csak sürg&otilde;sségi esetekre használnak. Csak akkor használja ezt a forródrótot, ha problémák merülnek fel egy közelg&otilde; esemény el&otilde;tt. </strong> </p>

		
	</body>
</html>
