<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>A PC beállítása</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="PC setup, dedicated graphic card, graphic card, AMD graphic card, high performance graphic card, system settings, screen saver, windows design, power plan" />
	</head>
	<body>
		
		
		<h1>A PC beállítása</h1>
		
		<p>A grandMA2 onPC legjobb futása érdekében, javasoljuk, hogy végezd el a következ&otilde; beállításokat a Pc-den.</p>

<hr />
<h2>Nagy teljesítmény&ucirc; energiagazdálkodás bekapcsolása</h2>

<p>Hogy a fentit bekapcsold:</p>

<ul>
	<li>Kattints a <strong>Start</strong> gombra <img alt="" src="../../img/icons_start-button_v3-2.png" />, és utána a <strong>Vezérl&otilde;pult</strong>. A keres&otilde; dobozba írd be az energiagazdálkodási opciókat, és utána kattints az <strong>Energiagazdálkodási opciókra</strong>. Válassz energiagazdálkodási sablont , kattints <strong>a További sémákra</strong>, és utána a <strong>Nagy teljesítmény&ucirc; energiasémára</strong>.</li>
</ul>

<hr />
<h2>Nagy-teljesítmény&ucirc; Energiagazdálkodási Opciók</h2>

<p>Kapcsolj ki mindent ami megakadályozhatja a grandMA2 onPC futását.</p>

<p>Az energiagazdálkodási opciók optimalizálásához:</p>

<ol>
	<li>Kattints a <strong>Séma beállításainak módosítására</strong>, és utána a <strong>Speciális energiaellátási beállítások módosítására</strong>.</li>
	<li>A merevlemez kikapcsolásánál válaszd a, <strong>Soha</strong> lehet&otilde;séget.</li>
	<li>Az USB beállításoknál, az USB szelektív felfüggesztés beállításait, állítsd, <strong>Letiltva</strong>-ra.</li>
	<li><strong>Kattints az Alkalmaz gombra</strong>.</li>
</ol>

<p>Az energiagazdálkodási opciók optimalizálva lettek.</p>

<hr />
<h2>Válaszd a Klasszikus Windows® Megjelenést</h2>

<p>To conserve the graphic card resources, select the Windows® Classic design.</p>

<ul>
	<li>Click the <strong>Start</strong> button <img alt="" src="../../img/icons_start-button_v3-2.png" />, and then click <strong>Control Panel</strong>. In the search box, type personalization, and then click <strong>Personalization</strong>. Under Basic and High Contrast Themes, click <strong>Windows® Classic.</strong></li>
</ul>

<p>A Klasszikus Windows® kinézet beállítva.</p>

<hr />
<h2>Tiltsd le a képerny&otilde;véd&otilde;t</h2>

<p>A grafikus kártya er&otilde;forrásainak felszabadítása érdekében, meg nehogy meglepi legyen, tiltsd le a képerny&otilde;véd&otilde;t.</p>

<ul>
	<li>Kattints a <strong>Start</strong> gombra <img alt="" src="../../img/icons_start-button_v3-2.png" />, utána a <strong>Vezérl&otilde;pultra</strong>. A keres&otilde;be írd be, személyre szabás, utána kattints a <strong>Személyre szabás</strong>. Kattints a <strong>Képerny&otilde;véd&otilde;re</strong>, és válaszd ki a listából a <strong>Nincs</strong>-et.</li>
</ul>

<p>A képerny&otilde;véd&otilde; kikapcsolva.</p>

<hr />
<h2>Optimalizáld a Rendszerbeállításokat</h2>

<p>A rendszerbeállítások optimalizálásához:</p>

<ol>
	<li>Kattints a <strong>Start</strong> gombra <img alt="" src="../../img/icons_start-button_v3-2.png" />, és utána a <strong>Vezérl&otilde;pultra</strong>. A keres&otilde;mez&otilde;be írd be. <strong>Rendszer</strong>. Kattints a <strong>Speciális Rendszerbeállítások,</strong> ott válaszd a <strong>Speciális</strong> fület, a Teljesítmény alatt kattints a, <strong>Beállításokra...</strong> .</li>
	<li>Válaszd a <strong>Speciális</strong>fület és kattints a <strong>Háttérszolgáltatásokra</strong>.</li>
	<li>Csak lassú videokártyáknál:<br />
	A <strong>Vizuális hatások</strong>-nál válaszd a <strong>legjobb teljesítmény</strong> opciót.<br />.</li>
</ol>

<p>A rendszerbeállítások most jók.</p>

<hr />
<h2> Rendeljen hozzá grandMA2 onPC-t a nagy teljesítmény&ucirc; grafikus kártyához </h2>

<div class = "fontos"> <strong> Információ: </strong> <br />
Csak akkor, ha a számítógép rendelkezik fedélzeti grafikus kártyával és további nagy teljesítmény&ucirc; grafikus kártyával. </div>

<p> A grandMA2 onPC szoftver hozzárendelése a nagy teljesítmény&ucirc; grafikus kártyához: </p>

<ul>
<li> Nyissa meg a nagy teljesítmény&ucirc; grafikus kártya Vezérl&otilde;pultját. További információkért lásd a nagy teljesítmény&ucirc; grafikus kártya kézikönyvét. </li>
</ul>

<p> A grandMA2 onPC szoftver a nagy teljesítmény&ucirc; grafikus kártyához van hozzárendelve. </p>

<h2> Válassza ki a dedikált AMD grafikus kártyát </h2>

<div class="important"><strong>Információ:</strong><br />
Csak akkor, ha a számítógépén integrált Intel HD grafikus kártya és dedikált AMD grafikus kártya van, kézzel kell kiválasztani a dedikált AMD grafikus kártyát. </div>

<p> A dedikált AMD grafikus kártya kiválasztása: </p>

<ol>
<li> Kattintson jobb egérgombbal az asztalon, és válassza a <strong> Catalyst </strong> <strong> Grafikai tulajdonságok </strong> lehet&otilde;séget. </li>
<li> Kattintson a Bekapcsolás elemre a <strong> Váltható grafikus alkalmazás beállításainál. </strong> </li>
<li> Kattintson a <strong> Minden alkalmazás </strong> pontnál. </li>
<li> Keresse meg a grandMA2 onPC-t, és válassza a Grafikus beállítások menü <strong> Nagy teljesítmény </strong> legördül&otilde; menüjét. </li>
<li> Kattintson a <strong> Alkalmaz. </strong> </li> elemre
</ol>

<p> A grandMA2 onPC a dedikált AMD grafikus kártyát használja. </p>
		
	</body>
</html>
