<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>A Backup Menü használata</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="backup, save show, save, file server, backup options, auto save, quick save, show - save" />
	</head>
	<body>
		
		
		<h1>A Backup Menü használata</h1>
		
		<p>A Backup menü az ahol a show fájlokat kezelni lehet. Az is ez ahol a show fájlokat menteni és betölteni lehet.</p>

<h2>Mi az a show fájl kezelés</h2>

<p>A show fájlkezelés, a show fájlok kezelése. A m&ucirc;sorok bels&#337;leg elmenthet&#337;k a pultba, és lehet&#337;ség van USB-pendrájvra és fájlszerverekre történ&#337; mentésre is. A modern fénypultok létfontosságú eleme, hogy el tudjuk menteni a m&ucirc;sort és újra betölthessük.</p>

<p>A fájlok megjelenítése is törölhet&#337;, hogy több helyet biztosítson a merevlemezen, vagy csak a pultból tisztítsuk meg.</p>

<p>A show fájl csak el&#337;re mozgatható. A Pendrájvra mentett m&ucirc;sor, amelyet el&#337;z&#337; verzióban programoztak, újabb verzióba betölthet&#337;. Ha a m&ucirc;sort ezután újból a pendrájvra mented, akkor az új verzióban nem lehet visszatölteni a régi szoftverre. Ha ez fontos, akkor szükség van a m&ucirc;sor betöltésére és új névvel történ&#337; mentésére. Ekkor a régi verziót nem menti új verzióként, és egy régebbi verzió továbbra is elérhet&#337;. </p>

<h2>A Show fájl tartalma</h2>

<p>A show fájl minden adatot tartalmaz, ahhoz, hogy a show-t futtatni lehessen.</p>

<p>Ez tartalmaz minden felhasználót és felhasználói profilt is.</p>

<p>Ez tartalmaz minden 3D-s modellt is ami az MA 3D-ben használható.&nbsp;</p>

<p>H az MA VPUs (= Video Processing Unit) használva van, akkor az MA VPU programozása is a show file része lesz, de a média fájlok már nem. Legyenek azért elmentve küls&#337; meghajtókra is - biztos ami biztos..</p>

<p>&nbsp;</p>

<h2>A backup menü és a különböz&#337; fülek</h2>

<p>A Backup Menüt megnyitásához nyomd meg a <span class="hardkey">Backup</span> gombot vagy használd a következ&#337; parancsot:</p>

<div class="cl_input">[Channel]&gt; Menu "Backup"</div>

<p>A Backup Menü két részb&#337;l áll. A fels&#337; rész a kézi show fájl kezeléshez. Az alsó rész a mentés opciókat tartalmazza.</p>

<p>Így néz ki a dolog:</p>

<figure class="caption"><img alt="" src="../../img/menu_backup_v3-3.png" />
<figcaption><em>Backup Menü</em></figcaption>
</figure>

<p>A fels&#337; részen van egy fejléc, ami a fájlnevet és az aktuális show mentési idejét mutatja. Mutatja még az aktuális szoftver verziót is.</p>

<p>Van még egy gomb amivel áthelyezhetjük a menüt másik képerny&#337;re, és végül egy bezárás gomb is helyet kapott..</p>

<p>Alatta három fül van. Itt minimum három fül van, ezek az "Internal"-bels&#337;, "Demoshows"-demoshow-k és "Templates"-sablonok. Lehet több is. Minden szoftver verzió ami telepítve van, az saját fület kap itt. Ez lehet&#337;vé teszi el&#337;z&#337; verziókban mentett show-k betöltését. Nem lehetséges a legújabb verzióból, a régebbi változatba való mentés.</p>

<p>Ha pendrájv van csatlakoztatva a pulthoz/PChez, akkor az is saját fülön jelenik meg. Válaszd ki a fület, és megváltozik az alapvet&#337; mentési hely a pendrájvra. Olvasd el a <a href="key_backup_menu_usb_stick.html">Pendrájv használata fejezetet</a>&nbsp;a további tudnivalókról, a pendrájvok kezeléséhez.&nbsp;</p>

<p>Ha egy fájlszerver van a rendszerhez adva, akkor az is külön fülön jelenik meg. Ez a fül kiválasztható a show-k mentéséhez/betöltéséhez a szerveren lév&#337; hely használatával. Beállítás és használat a <a href="key_backup_menu_file_server.html">fájlszerver beállítása</a>&nbsp;fejezetben.&nbsp;</p>

<p>A kiválasztott fül, és a kiválasztott "meghajtó" megadásakor, ide ment&#337;dnek a showk. A meghajtót kiválaszthatod természetesen parancssorból is - a parancs neve <span class="syntax">SelectDrive</span> vagy röviden SD - olvashatsz róla <a href="key_keyword_selectdrive.html">itt</a>.&nbsp;</p>

<h3>Internal - Bels&#337;</h3>

<p>Ez a fül a bels&#337; tárhelyet jelenti a pultban vagy az onPC-ben.&nbsp;</p>

<p>Ha az onPC-t használod, akkor a <span class="syntax">SelectDrive</span>&nbsp;parancsot használhatod a meghajtó számának megadása nélkül is, a tároló helyek megjelenítéséhez.</p>

<p>A bels&#337; meghajtó megtehet mindent, kivéva az ASCII Show beolvasását.</p>

<p>Ha a pult frissítve van, akkor az Internal fül tartalmazza a verziószámot is.</p>

<div class="restriction">Egy teljes telepítés, ami formázza a meghajtót, az törli az összes show fájlt és eltávolít minden el&#337;z&#337; fület is a menüb&#337;l.</div>

<h3>Demoshows - Demo show-k</h3>

<p>A demo show fül egy csak olvasható fül. Innen csak betölteni lehet showkat. Lehetséges részleges show beolvasást csinálni ebb&#337;l a mappából.</p>

<p>Ha frissül a pult szoftvere, akkor az itt lév&#337; show-k felülíródnak.</p>

<h3>Templates - Sablonok</h3>

<p>A template fül funkcióiban olyan mint a demoshow, azzal a kivétellel, hogy a pult frissítésekor nem törl&#337;dnek az itteni fájlok. Egy formázás és telepítés természetesen törli az itt lév&#337; fájlokat!</p>

<p>Az ötlet az, hogyha van egy hely ahol alapvet&#337;en ugyanaz a cucc van felrakva, de több show van, akkor ide másolható egy alapbeállítás ebbe a mappába. Ezt aztán betölthet&#337; és elmenthet&#337; mint új show a bels&#337; tárolóra. Ez megvédi az alap show-t a véletlen változtatástól. Ide bemásolni valamit csak <a href="key_network_ftp.html">FTP kapcsolattal lehetséges</a>.</p>

<h3>Server tab - Kiszolgáló fül</h3>

<p>Ha m&ucirc;köd&#337; kapcsolat, és beállított fájlszerver van a hálózaton, akkor egy extra fül jelenik meg  meghatározott névvel. Ez úgy m&ucirc;ködik mint a bels&#337; meghajtó.</p>

<p>Ez csak akkor látszik, ha a pult a master a munkamenetben.</p>

<div class="restriction">grandMA2 onPC mint Master nem támogatja a szerver biztonsági mentést</div>

<p>Olvasd el a <a href="key_backup_menu_file_server.html">File Szerver beállítása</a> fejezetet a továbbiakért.</p>

<h3>USB tabs - USB fülek</h3>

<p>Amikor kompatibilis pendrájvot dugunk be, akkor megjelenik egy újabb tab a pendrájv nevével.&nbsp;</p>

<p>Ez ugyanúgy m&ucirc;ködik, mint a bels&#337; meghajtó és még az ASCII show beolvasást is támogatja.</p>

<p>Gyors mentéskor a pendrájvra ment&#337;dik a show <strong>és</strong> a bels&#337; meghajtóra is.</p>

<p>Olvasd el<a href="key_backup_menu_usb_stick.html">ezt </a>,a pendrájvokról és arról, milyen korlátozások és tanácsok lehetnek ezzel kapcsolatban.</p>

<h3>Version tabs - Verzió fülek</h3>

<p>Az el&#337;z&#337;leg telepített változatoknak saját fülük van itt. Showkat lehet innen betölteni és törölni ezeken a füleken.</p>

<p>&nbsp;</p>

<h2>Backup Opciók</h2>

<p>A backup opciók lehet&#337;vé teszik a fájl szerver beállítását és bekapcsolhatod az automata mentést is.</p>

<p>A szerver beállítás bonyolult is lehet, ezért annak megvan a saját fejezete <a href="key_backup_menu_file_server.html">itt</a>.&nbsp;</p>

<h3>Auto Save</h3>

<p>Az auto mentés beállítja, hogy bizonyos id&#337;közönként automatikusan ment&#337;djön a show..&nbsp;</p>

<p>Az alapbeállítás az "Off" - ki. A többi opció a 15, 30, 60 és 120 perc.</p>

<p>Ha az automata mentés aktív - id&#337; kiválasztásával - akkor egy visszaszámláláó látható a cimke mellett.</p>

<p>Ha számláló eléri a nullát, akkor a show elment&#337;dik a kiválasztott meghajtóra. Ha olyan fül van kiválasztva, amire nem lehet menteni, akkor a bels&#337; meghajtóra ment&#337;dik a show.</p>

<p>Olvasd el a további oldalakat is a különböz&#337; m&ucirc;veletekr&#337;l amiket még elkövethetsz a fülekkel.</p>

		
	</body>
</html>
