<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Mik a képek és szekvenciák</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="cues, sequences" />
	</head>
	<body>
		
		
		<h1>Mik a képek és szekvenciák</h1>
		
		<p>Képesnek lenni eltárolni és visszahívni attribútumok értékeit, egy a legfontosabb képessége egy vezérl&otilde; rendszernek.</p>

<p>Ennek az els&otilde;dleges módja a <strong>Képek</strong> használata. A képek tárolt értékeket tartalmaznak. A képek <strong>Szekvenciákba</strong> vannak szervezve. A szekvenciákat <strong>Executorokhoz</strong> rendelhetjük hozzá a kényelmes lejátszás vezérléshez. Olvass többet az executorokról az <a href="key_exec.html">Executorok fejezetben</a>.</p>

<p>A képeket feloszthatjuk különböz&otilde; részekre ezeket "Part Cues"-képrésznek hívjuk. Egy attribútum értéke csak egy részben szerepelhet. Ezt a következ&otilde; fejezetben írjuk le.</p>

<p>A szekvenciákkal azt is ellen&otilde;rizhetjük, hogyan változnak az értékek az egyik képr&otilde;l a másikra, és sok más releváns beállítást. </p>

<p>Ezek a következ&otilde; fejezetben vannak leírva.</p>

<h2><a id="sequence_pool" name="sequence_pool"></a>A Szekvencia Tároló</h2>

<p>A szekvenciák tárolókba vannak szervezve. Ez így fest:</p>

<figure class="caption"><img alt="" src="../../img/window_sequence-pool_v3-3.png" />
<figcaption><em>Szekvencia Tároló - tároló mód</em></figcaption>
</figure>

<p>Ha tárolók még újdonságnak számítanak, akkor nézd meg ezt: <a href="key_pools.html">Tárolókról általában fejezet</a>.</p>

<p>Minden tárolóelem (egyenl&otilde; minden szekvenciával a showban) mutat némi információt a szekvencia beállításáról és más fontos információkat.</p>

<p>Az alsó fele a tárolóobjektumnak tartalmazza a szekvencia nevét.</p>

<p>A fels&otilde; sorban balra látható a szekvencia száma. Ha ez a szám cián szín&ucirc; akkor a szekvencia hozzá van rendelve egy executorhoz. Ha nincs hozzárendelve akkor a száma szürke.</p>

<p>Vannak bet&ucirc;k amik a szekvencia prioritását jelölik. A prioritások a <a href="key_cs_playback.html">Képek visszajátszása fejezetben</a> leírva. A különböz&otilde; bet&ucirc;k listája a <a href="key_ws_text_indicators.html">Bet&ucirc;k és szimbólumok jelentése fejezetben </a>vannak.</p>

<p>Lehet egy "T" bet&ucirc; a prioritásjelz&otilde; mellett. Ez mutatja, hogy a követés be van kapcsolva (látható T) vagy ki van kapcsolva a szekvencián. A követésr&otilde;l leírás a <a href="key_cs_what_is_tracking.html">Mi az a tracking fejezetben</a>található.</p>

<p>Lehet még két ikon a fels&otilde; sorban. Lehet egy sz&ucirc;r&otilde; ikon, amikor a szekvenciához bejöv&otilde; sz&ucirc;r&otilde; lett társítva. A filterekr&otilde;l a <a href="key_wfm_what_are_filters.html">Mik azok a Filterek fejezetben</a>lehet olvasni. A másik ikon az információs ikon. Ez akkor jelenik meg, ha valamilyen információt írtunk a szekvenciába (ez semmit nem csinál a képekben lév&otilde; információkkal - ez a szekvenciáról szól).</p>

<p>A fels&otilde; sor alatt, lehet egy cián szín&ucirc; szekvenciaszám a bal oldalon. Ez mutatja hogy hány executorhoz rendeltük hozzá a szekvenciát.</p>

<h2>Lap mód</h2>

<p>A szekvencia tárolót lehet "Lap módban"is nézni. Ezt a Pool Options-nál lehet állítani - olvasd el a <a href="key_pools.html">Tárolókról Általában fejezetet</a>.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/window_sequence-pool_sheet-mode_v3-3.png" />
<figcaption><em>Szekvencia Tároló - lap mód</em></figcaption>
</figure>

<p>A címsorban három gomb van.</p>

<p>A jobb oldali elrejti vagy megmutatja az üres tároló elemet a szekvencia lapon.</p>

<p>A középs&otilde; változtatja a Call Mode-Hívási módot a szekvenciának Tároló/Lap. Ha a "Pool Playback" mód van kiválasztva, akkor egy extra gomb jelenik meg. Ezt "Direct Action"-közvetlen akciónak hívjuk és ez kapcsolja a direkt akció módját a tároló visszajátszásának. A különböz&otilde; hívási módokról a <a href="key_pools_call_modes.html">Hívási Módok fejezetben</a>van infó. A Tárolók visszajátszása a <a href="key_cs_playback.html">Képek visszajátszása fejezetben</a>található.</p>

<p>A szekvencia lap minden szekvenciát soronként mutat. Az oszlopok pedig a szekvenciához tartozó beállításokat mutatják. Minden aminek szürke a háttere, az szerkeszthet&otilde;.</p>

<ul>
	<li><strong>No.:</strong><br />
	Ez a szekvencia száma. Itt nem lehet megváltoztatni - de a szekvencia tárolóban lehet mozgatni &otilde;ket.</li>
	<li><strong>Name:</strong><br />
	Ez a szekvencia neve. A tárolóból vett keretszíne van. A cellát szerkesztve megváltoztatható a neve.</li>
	<li><strong>Track:</strong><br />
	Itt lehet be/ki kapcsolni a tracking-követést a szekvenciához. A követés leírása: <a href="key_cs_what_is_tracking.html">Mi az a Tracking-követés fejezetben</a>van.</li>
	<li><strong>Release Firststep:</strong><br />
	Itt kapcsolható a "Release First Step"-engedd el az els&otilde; lépést. Ez a követéshez tartozik - lásd fenti link.</li>
	<li><strong>CueZero:</strong><br />
	Ezt szerkesztve egy ablakocskában szerkesztheted a Zéró Kép módot. A Zéró képr&otilde;l b&otilde;vebben: <a href="key_adv_seq_cue_zero.html">Zéró Kép fejezetben</a>olvashatsz.</li>
	<li><strong>CueZero Extract:</strong><br />
	A Zéró Kép Kivonat is ki/be kapcsolható. Ez a Zéró Kép funkcióhoz kapcsolódik  leírás, lásd fenn.</li>
	<li><strong>Input Filter:</strong><br />
	Itt állíthatsz be bemeneti sz&ucirc;r&otilde;t. A sz&ucirc;r&otilde;k és szekvenciák a <a href="key_wfm_apply_to_exec_seq.html">Világok vagy sz&ucirc;r&otilde;k alkalmazása az executorokban és szekvenciákban fejezetben </a>vannak leírva.</li>
	<li><strong>Timecode Slot:</strong><br />
	Itt választhatsz egy timecode tartót a szekvenciához. Olvasd el a <a href="key_timecode.html">Timecode fejezetet</a> ha szekvenciákhoz akarsz timecode-t használni.</li>
	<li><strong>Info:</strong><br />
	Itt lehetséges többsoros információt írni a szekvenciához.</li>
	<li><strong>Forces Pos. mode:</strong><br />
	Az egész szekvenciát er&otilde;ltetett pozíciós módba teszi. Ez fontos ha kevert Pan/Tilt értékeket és XYZ értékeket használsz. Olvass többet a <a href="key_xyz_pan_tilt_in_cues_sequences.html">XYZ és pan/tilt a képekben és szekvenciákban fejezetben</a>.</li>
	<li><strong>Used Count:</strong><br />
	Ez a szám mutatja, hogy hány db. executor van hozzárendelve az adott szekvenciához. Ez nem egy változtatható beállítás - ez csak információ.</li>
</ul>

<p>&nbsp;</p>

		
	</body>
</html>
