<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>PosiStageNet (PSN)</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="PSN, PosiStageNet" />
	</head>
	<body>
		
		
		<h1>PosiStageNet (PSN)</h1>
		
		<p>A PosiStageNet vagy PSN egy nyílt protokoll amit az MA Lighting és a VYV Corporation fejleszt - <a href="http://www.posistage.net/">http://www.posistage.net/</a>.</p>

<div class="restriction"><strong>Korlátozás:</strong><br />
A grandMA2 A PSN 2.0-ás verzióját támogatja</div>

<p>Egy PSN szervert használ ami a pozíció információkat továbbítja a különböz&otilde; nyomkövet&otilde;kt&otilde;l a szerver felé.</p>

<p>A grandMA2 csatlakozhat a szerverhez, mint kliens és fogadhat információkat minden egyes nyomkövet&otilde;t&otilde;l.</p>

<p>Általában, a nyomkövet&otilde; információkat összekötöd egy patchelt StageMarker-hez. A StageMarker ezután a bejöv&otilde; nyomkövet&otilde; információ szerint fog mozogni.</p>

<p>Ezután megmondhatod az XYZ engedélyezett lámpknak, hogy kövessék a mozgó StageMarker-t.</p>

<div class="tip"><strong>Tipp:</strong><br />
Lehetséges akár 1024 StageMarker-t bepatchelni.</div>

<h2>Csatlakozás PSN szerverre</h2>

<p>PSN szerver hozzáadásához, meg kell nyitnod a <span class="softkey">PSN Network Configuration</span> a <span class="hardkey">Setup-ban</span>.</p>

<p>Bökj az <span class="softkey">Add</span> gombra az ablak aljában. Utána lesz egy sorod a fenti ablakban.</p>

<p>A sort engedélyezni kell. Szerkeszd az <strong>Enabled</strong> cellát a konfigurációban, addig ameddig azt írja "Yes". Ekkor kell kapnod egy IP címet az <strong>IP</strong> oszlopban - ez az IP címe a szervernek. A <strong>Name</strong> cella is megváltozik a szerver nevére. Ha a kapcsolat jó, akkor a név is zöld szín&ucirc; hátter&ucirc; lesz.</p>

<p>A <strong>World</strong> oszlop mutatja a PSN világot, amiben a szerver van. Ez csak információ. Ez egy beállítás a szerveren és nem használja a grandMA2.</p>

<p>Lehetséges megváltoztatni a <strong> Port</strong>-ot és a PSN-t <strong>Multicast</strong> címét ha a szerver nem támogatja az általános portot és multicast címet.</p>

<p>Ha PSN adatokat akarod használni, akkor szükséged lesz az általános PSN funkciók bekapcsolására is. Ezt a nagy <span class="softkey">Enabled</span> gombbal tudod megtenni a jobb oldalán a nézetnek.</p>

<p>Ha létez&otilde; PSN szerver van jelen, akor a nézet így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/menu_psn-network-configuration_v3-2.png" />
<figcaption><em>PSN&nbsp;Hálózati beállítások érvényes szerver kapcsolattal</em></figcaption>
</figure>

<p>&nbsp;</p>

<h2>Nyomkövet&otilde; összekapcsolása StageMarker-el</h2>

<p>Ha látni akarod a bejöv&otilde; nyomkövet&otilde; információkat, akkor bökj a <span class="softkey">View Tracker</span> gombra a képerny&otilde; alján.</p>

<p>Ez megnyitja a <strong>View Tracker ablakot</strong>. 
Ha nincs kapcsolatod a PSN szerverrel, akkor ez az ablak üres.</p>

<p>Ha van szervered, akkor a táblázat a szerver információiról látható.</p>

<p>Lét dolgot lehet szerkeszteni ebben az ablakban:</p>

<p>A <strong>Fixture ID</strong> amit hozzárendelhetsz a nyomkövet&otilde;höz. Írd be a lámpa ID-t a StageMarker-hez amelyiket mozgatni akarod a nyomkövet&otilde; által.</p>

<p>A <strong>Predict</strong> értéke is megváltoztatható. Ilyenkor a pult megpróbálja kitalálni a következ&otilde; pozícióját a nyomkövet&otilde;nek. Az ide beírt szám, a másodpercekben megadott érték, amikor a pult megpróbálja kitalálni a következ&otilde; helyet a sebesség és irány alapján..</p>

<p>Ha ezt "0.00" hagyod, akkor a szerver dolga a számítás és jóslás.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/menu_psn-network-configuration_view-tracker_v3-2.png" />
<figcaption><em>Nyomkövet&otilde; megtekintése -&nbsp;PSN&nbsp;információk a szervert&otilde;l hozzárendelt lámpa ID-kkel</em></figcaption>
</figure>

<p>&nbsp;</p>

<p>Ebben a példában, a nyomkövet&otilde; a 0 PSN ID-t használva, hozzárendelve a 4001-es lámpa ID-hez (egy StageMarker). Az aktuális pozíció és forgás 0 méter és 0 fok mindhárom síkban.</p>

<p>Amikor a nyomkövet&otilde; elkezd mozogni, az információk frissülnek és a StageMarker követi a mozgást.</p>

<p>A <span class="softkey">3D Text</span> gomb a fels&otilde; képen átugorható - nem csinál semmit, és nincs implementálva.</p>

<p>&nbsp;</p>

		
	</body>
</html>
