<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Mi a 3D és színpad beállítás</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="3D, stage setup" />
	</head>
	<body>


		<h1>Mi a 3D és színpad beállítás</h1>

		<p>A grandMA2-nek van 3D-s virtuális ter. Ebben a térben látszik az összes patchelt eszköz ésa potíciójuk. A 3D-s térnek lehetnek más objektumai és elemei is. Ezzel lehet modellezni a helyszínt és a lámpákat.</p>

<p>Általában két módja van, hogy ezt megtekinthessük. A grandMA2 szoftverében és az MA 3D vizualizálóban, ami windowsos számítógépen fut.</p>

<p>Mindkett&otilde; össze van kapcsolva és információkat mutat, amiket a show fájlban tárolunk. Akkor van értelme ezeket használni, ha szánunk rá id&otilde;t és <a href="key_patch_position_fixtures.html">elrendezzük a virtuális lámpákat a valódi térnek megfelel&otilde;en</a>.</p>

<p>&nbsp;</p>

<p>Az grandMA2 szoftverben egy nagyon leegyszer&ucirc;sített változata látható. Ezt láthatod a <a href="key_patch_stage.html">Színpad ablakban</a>.</p>

<p>Ebben egy egyszer&ucirc;sített drótvázas modell látható a lámpákkal és a kijöv&otilde; fény pedig egy egyszer&ucirc; vonallal van ábrázolva, ami mutatja a fény irányát és színét.</p>

<p>Minden lámpát egy dobozka mutat és minden 3D-s elem is így jelenik meg.</p>

<p>A beépítet 3D színpadnézet, hasznos lehet programozáskor és nagy segítség is egyben.</p>

<p>&nbsp;</p>

<p>Az MA 3D megjelenít&otilde;ben realisztikusabb képet láthatsz arról, amit a lámpák csinálnak és ahogy a 3D-s modell kinéz. A szoftver ingyenes és letölthet&otilde; az MA honlapjáról.</p>

<p>Windowsos gépen futtatható, amelynek azonos hálózaton kell lennie mint a pult vagy onPC. Ha men&otilde; géped van akkor mindkét program futhat ugyanazon a gépen is.</p>

<p>A m&ucirc;ködéshez <a href="key_network_session.html">munkamenetet</a> kell futtatni a putlon/onPc-n és utána meghívhatod az MA 3D-t a munkamenetbe. Amellett, hogy áttölt&otilde;dik a patch és lámpapozíciók adatai is, a felhasználó választást is lehet&otilde;vé teszi. ha ugyanazt a felhasználót választod ki a pulton, mint a 3D ben, a program követni fogja a Blind és Preview módokat. Ez hasznos amikor a programozáson kell változtatni mondjuk el&otilde;adás közben.</p>

<p>A f&otilde; gondolat az MA 3D-ben a showk el&otilde;re elkészíthet&otilde; programozásában rejlik. Lehet&otilde;vé teszi a show megjelenítését és programozását, anélkül, hogy szükség lenne a cuccokra a helyszínr&otilde;l. Letöltheted ind a grandMA2 onPC és MA3D programokat ingyen és kezd&otilde;dhet a programozás, az összes elérhet&otilde; paraméterrel. Amikor el&otilde;sz&otilde;r akarod a paramétereket kiküldeni a valós lámpákhoz, akkor kell igazi MA eszköz hozzá.</p>


	</body>
</html>
