<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Eszközök</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="Tools tab in Sheet Options" />
	</head>
	<body>
		
		
		<h1>Tools - Eszközök</h1>
		
		<p>Az eszközök fül sok különböz&otilde; beállítást tartalmaz amik ki/be kapcsolnak különböz&otilde; eszközöket a lapokon. Az eszközök által hatékonyabban tudsz dolgozni.</p>

<p>Az utolsó része az opcióknak itt van leírva, szintén elérhet&otilde; a <a href="key_of_sheet_options_title_buttons.html">Fejléc gomboknál</a>.</p>

<p>&nbsp;</p>

<h2>Preset Control - El&otilde;beállítások Vezérlése</h2>

<p>A <strong>Preset Control</strong> egy lehet&otilde;ség a csatorna, lámpa, tartalom és követ&otilde; lapoknál.</p>

<p>A Preset Control ki/bekapcsolja a láthatóságát a preset Vezérl&otilde;sávnak a lap alján.</p>

<p>Használható különböz&otilde; presetek típusának választásához. A sáv hasonló a preset Vezérl&otilde;sávhoz, ami a kódoló sávon látszik.</p>

<p>Olvashatsz róla a <a href="key_ws_preset_control_bar.html">Preset Vezérl&otilde;sáv alfejezetében</a>.</p>

<div class="restriction"><strong>Korlátozások:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&otilde;sáv láthatatlan.</div>

<h2>Layer Control - Réteg Vezérlés</h2>

<p>A <strong>Layer Control</strong> egy lehet&otilde;ség a csatorna, lámpa, tartalom, és követés lapokon.</p>

<p>A Layer Control opció ki/bekapcsolja a Réteg Vezérl&otilde;sávot a lap alján.</p>

<p>A Layer Vezérl&otilde;sáv hozzáférést ad különböz&otilde; adatrétegekhez a lámpákhoz.</p>

<p>B&otilde;vebben a <a href="key_of_layers_in_sheets_channel_and_fixture.html">Rétegek a programozásban fejezetben</a>.</p>

<div class="restriction"><strong>Korlátozások:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&otilde;sáv láthatatlan.</div>

<h2>Mask Control - Maszk vezérlés</h2>

<p>A <strong>Mask Control </strong>egy lehet&otilde;ség a csatorna és lámpa lapokon.</p>

<p>A Mask Control ki/be kapcsol egy kis maszk vezérl&otilde;sávot az alapvet&otilde; maszkokkal.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/img_mask-control-bar_v3_3.png" />
<figcaption><em>Maszk Vezérl&otilde;sáv</em></figcaption>
</figure>

<p>A maszkok a <a href="key_wfm_what_are_masks.html">Maszk fejezetben</a> vannak részletezve.</p>

<div class="restriction"><strong>Korlátozás:</strong><br />
Ha a Multi Control be van kapcsolva, akkor ez a vezérl&otilde;sáv láthatatlan.</div>

<h2>Multi Control - Többségi vezérlés</h2>

<p>A <strong>Multi Control</strong> egy lehet&otilde;ség a csatorna, lámpa és tartalom lapokon.</p>

<p>A multi control kombinálja a réteg, preset és maszk vezérl&otilde;ket egy sávban három b&otilde;víthet&otilde; gombbal - ebben a sorrendben balról jobbra.</p>

<p>Így nézhet ki:</p>

<figure class="caption"><img alt="" src="../../img/img_multi-control-bar_v3_3.png" />
<figcaption><em>Multi Vezérl&otilde;sáv</em></figcaption>
</figure>

<p>Az opciók elérhet&otilde;ek minde gombra, pontosan úgy mint a saját vezérl&otilde;sávukban.</p>

<div class="restriction"><strong>Korlátozás:</strong><br />
Ha a Multi Control be van kapcsolva, akkor a Preset Control, Layer Control, és a Mask Control rejtett lesz.</div>

<h2>ScrollBar horizontal - Görget&otilde;sáv vízszintes</h2>

<p>a <strong>ScrollBar horizontal</strong> egy lehet&otilde;ség a lámpa, tartalom, executor, és követ&otilde; lapon.</p>

<p>Ezzel lehet ki/bekapcsolni a vízszintes görget&otilde;sáv megjelenítését a lap alján.</p>

<p>A görget&otilde;sáv csak akkor látszik ha szükséges.</p>

<h2>ScrollBar vertical - Görget&otilde;sáv függ&otilde;leges</h2>

<p>A <strong>ScrollBar vertical</strong> egy lehet&otilde;ség a csatorna, DMX, lámpa, tartalom, executor, és követ&otilde; lapokon.</p>

<p>Ezzel lehet ki/bekapcsolni a függ&otilde;leges görget&otilde;sáv megjelenítését a lap jobb oldalán.</p>

<p>A görget&otilde;sáv csak akkor látszik ha szükséges.</p>

<h2><a id="link_encoders" name="link_encoders"></a>Link Encoders - Kódolók összekapcsolása</h2>

<p>A <strong>Link Encoders</strong> egy lehet&otilde;ség a DMX, tartalom, executor, és követ&otilde; lapokon.</p>

<p>Ha ez aktív az adott lapon (belebökve a lapba) akkor megváltozik a <a href="key_ws_encoder_toolbar.html">kódoló eszköztár</a>. Az eredmény változik a lap típusától függ&otilde;en.</p>

<h3>DMX Sheet - DMX Lap</h3>

<p>A kódoló átváltozik DMX tesztel&otilde;vé. Olvass róla b&otilde;vebben a <a href="key_patch_dmx_testing.html"> DMX tesztelése fejezetben</a>.</p>

<h3>Content Sheet and Tracking Sheet - Tartalom Lap és Követ&otilde; Lap</h3>

<p>A kódoló átváltozik Executor Eszköztárrá. Olvass róla b&otilde;vebben a <a href="key_exec_what_are.html">mik azok az executorok fejezetben</a>.</p>

<h3>Executor Sheet - Executor Lap</h3>

<p>Ez egy kicsit el van rejtve mint opció az executor lapon. Hozzá kell adnod mint <a href="key_of_sheet_options_title_buttons.html">fejléc gomb </a> a be/kikapcsoláshoz.</p>

<p>Ez is megnyitja az Executor Eszköztárat. Kövesd a linket a "Tartalom Lapnál" feljebb az egyéb információkért.</p>

<h2><a id="edit_cueonly" name="edit_cueonly"></a>Edit CueOnly - Csak a kép szerkeztése</h2>

<p>Az <strong>Edit CueOnly</strong> egy lehet&otilde;ség a tartalom és követ&otilde; lapokon.</p>

<p>Ha ez a z opció <strong>on</strong>, minden váltoás amit a lapon elkövetsz Cue Only módon lesz tárolva. Az értékek szerkesztésér&otilde;l e két lapon, a <a href="key_cs_cue_content.html">Nézzünk bele a kép tartalmába fejezetben</a> olvashatsz.</p>

<h2>DMX Readout Absolute - DMX kiolvasása abszolút értékben</h2>

<p><strong>DMX Readout Absolute</strong> egy lehet&otilde;ség a DMX lapon.</p>

<p>Ez az opció lehet&otilde;vé teszi, hogy a DMX címeket abszolút, vagy elkülönült értékként nézd az univerzumban.</p>

<p>Ha az Absolute kiolvasás van beállítva, akkor csak egy számként jelenik meg az érték. Ez azt jelenti, hogy a DMX értékek folyamatosan növekv&otilde; számokként jelennek meg. Az els&otilde; DMX szám a második univerzumban 513 lesz. (512 az els&otilde; univerzumból plussz 1).</p>

<p>Ha a Separated kiolvasás van beállítva, akkor a lapon két szám jelenik meg egy ponttal elválasztva. Az els&otilde; szám az univerzum száma, a második pedig a DMX cím lesz ebben az unvierzumban.</p>

		
	</body>
</html>
