<!DOCTYPE html>
<html lang="hu">

<head>
	<title>DMX és Paraméterek listája</title>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<meta charset="utf-8" />
	<meta name="keywords" content="DMX list, parameter list" />
</head>

<body>


	<h1>DMX és Paraméterek listája</h1>

	<p>Ebben a fejezetben megnézünk két listát amit elérhetünk a <a href="key_patch_livepatch.html">Live Setup menüb&otilde;l</a>.</p>

	<p>Ezeket a listákat megnyithatod a <span class="hardkey">Setup</span> gomb megnyomásával, mjad ha ráböksz a <span class="softkey">Patch Only (Live)</span>-ra.</p>

	<h2><a id="dmx_list" name="dmx_list"></a>DMX Lista</h2>

	<p>Amikor a Live Setup-él&otilde; beállításokban vagy, akkor látsz egy gombot jobb oldaloon DMX List néven. Ha a menü az els&otilde; képerny&otilde;n van akkor megnyomhatod a  <span class="hardkey">U4</span> gombot vagy egyszer&ucirc;en bökj a <span class="softkey">DMX List</span> gombra a képerny&otilde;n - akkor is ha a menü más képerny&otilde;n van.</p>

	<p>Így kellene kinéznie:</p>

	<figure class="caption"><img alt="" src="../../img/window_dmx-list_v3-2.png" />
		<figcaption><em>DMX Lista</em></figcaption>
	</figure>

	<p>A DMx Lista két részb&otilde;l áll.</p>

	<p>A bal oldal mutatja az összes univerzumot és azok tulajdonságait.</p>

	<p>A jobb oldal mutatja az összes DMX címet, a bal oldalon kiválasztott univerzumban. Megnézheted mi van patchelve minden címhez és hozzárendelhetsz DMX profilokat a DMX címekhez. Ez csak információkat mutat. Nem tudod megváltoztatni, kivéve a DMX profilt. A DMX profil celláját szerkesztve kapsz egy kis ablakocskát az összes elérhet&otilde; DMX profilról. A DMX profilokról b&otilde;vebben  <a href="key_dmx_profiles.html">itt olvashatsz</a>.</p>

	<p>A bal oldalon több oszlop van ezek közül többet is szerkeszthetsz - minden szürke hátter&ucirc;t megváltoztathatsz. Itt egy rövid leírás minden bal oldali oszlopról:</p>

	<p><strong>Number:</strong></p>

	<p>Ez az univerzum száma. Nem lehet megváltoztatni.</p>

	<p><strong>Name:</strong></p>

	<p>Ez az univerzum neve. Ide beírhatsz egy nevet ami segít könnyebben azonosítani, hogy melyik univerzumot mire használod.</p>

	<p><strong>DMX In Merge:</strong></p>

	<p>A cellákat szerkesztve itt a következ&otilde; ablakocska jelenik meg:</p>

	<figure class="caption"><img alt="" src="../../img/popup_select-dmx-in-merge_v3-2.png" />
		<figcaption><em>Kis válaztó ablakocska - Válassz DMX bekeverést</em></figcaption>
	</figure>

	<p>Három opciót lehet választani: <strong>Off</strong>, <strong>HTP</strong>, és <strong>LoTP</strong>.</p>

	<ul>
		<li><strong>Off</strong> - azt jelenti minden bejöv&otilde; DMX nem lesz összefésülve az univerzumban.</li>
		<li><strong>HTP</strong> - ez az alapbeállítás. HTP az jelenti, hogy a bejöv&otilde; DMX összeolvad a pultból jöv&otilde; DMX-el és a legmagasabb DMX érték lesz a kimenetre küldve.</li>
		<li><strong>LoTP</strong> - azt jelenti, hogy a bejöv&otilde; DMX összefésül&otilde;dik a pultból jöv&otilde; DMX-el és a legkissebb DMX érték lesz a kimenetre küldve.</li>
	</ul>

	<p><strong>RDM:</strong></p>

	<p>Itt lehet be/ki kapcsolni az RDM funkcionalitást az adott DMX univerzumra. Többet megtudhatsz az <a href="key_rdm.html">RDM-r&otilde;l itt</a>.</p>

	<p><strong>RDM Devices:</strong></p>

	<p>Itt mutatja a felfedezett RDM eszközöket a DMX univerzumban.</p>

	<p><strong>Requested:</strong></p>

	<p>Itt látható melyik univerzumot akarod vezérelni. Ki/be lehet kapcsolni (a cella üres amikor ki van kapcsolva) az univerzum kimenete.</p>

	<p><strong>Granted:</strong></p>

	<p>Itt látható ha egy univerzum engedélyezett. Egy univerzum lehet nem engedélyezett, ha nincs elég paramétered. A konzol engedélyezi a paramétereket annyi lehetséges univerzumnak amennyiek csak tudja az 1-t&otilde;l kezd&otilde;d&otilde;en. Ha nem kértél engedélyt univerzumra akkor az nem lesz engedélyezve&nbsp;</p>

	<p><strong>Info:</strong></p>

	<p>Ide írhatsz információkat az univerzumról.</p>

	<p>&nbsp;</p>

	<p>Az itt eszközölt változások azonnal végrehajtódnak.</p>

	<p>Ez volt a DMX Lista.</p>

	<hr />
	<h2><a id="parameter_list" name="parameter_list"></a>Paraméter lista</h2>

	<p>Amikor az él&otilde; beállításban vagy, akkor alul látsz egy gombot Parameter List névvel. Ha a menü az els&otilde; képerny&otilde;n van akkor megnyomhatod az <span class="hardkey">X16</span> gombot vagy csak bökj a <span
			class="softkey">Parameter List</span> gombra a képerny&otilde;n - mégha a menü másik képerny&otilde;n is van.</p>

	<p>Ilyesmiképpen festhet:</p>

	<figure class="caption"><img alt="" src="../../img/window_parameter-list_v3-2.png" />
		<figcaption><em>Paraméter Lista</em></figcaption>
	</figure>

	<p>Ismét egy lista ami két oldalra van felosztva. A bal oldali lista mutatja a rétegeket a lámpatábálzatban. A jobb oldalon az összes paramétert láthatod a bal oldalon kiválasztott rétegb&otilde;l.</p>

	<p>A bal oldalon csak a név és információ mez&otilde;ket szerkesztheted minden réteghetz.</p>

	<p>A jobb oldalon sokkal több oszlopot lehet szerkeszteni. Amit itt szerkesztesz az kapcsolódni fog a paraméterekhez és követni is fogja. Tehát újra-patchelheted a lámpákat és a beállítások követni is fogják. Az oszlopokat sorba is rendezheted. tehát rendezheted &otilde;ket Id szám, név, cím, attribútum stb. szerint. A rendezés lehet növekv&otilde; és csökken&otilde; is.</p>

	<p>Következik egy rövid leírás mindegyik szerkeszthet&otilde; oszlopról.</p>

	<ul>
		<li><strong>Default:</strong><br />
			Ez az alapértelmezett értéke a paraméternek.</li>
		<li><strong>Highlight:</strong><br />
			Ezt az értéket veszi fel amikor aktiválod a Highlight(kiemelés) funkciót. Sok paraméternek (a Dimmert&otilde;l eltér&otilde;en) van "None" érték beállítva. Ez azt jelenti, hogy azt a paramétert a kiemelés nem fogja felülírni.</li>
		<li><strong>Stage:</strong><br />
			Itt akkor van érték, ha a<a href="key_patch_autocalibrate.html">Lámpa automatikus pozíció kalibrálása módban vagy</a>. Ez tipikusan nem beállított érték (None értékkel).</li>
		<li><strong>Snap:</strong><br />
			Itt kapcsolhatod be az azonnali funkciót(Snap) a paraméterhez. Ez azt jelenti, hogy nem úsztathatsz át értékek között. A paraméter megváltozik az új értékre, amit a "Snap Percent"nél megadsz minden képben.</li>
		<li><strong>Invert:</strong><br />
			Itt lehet megfordítani a DMX kimenetet a paraméterhez.</li>
		<li><strong>MIB disable:</strong><br />
			Itt tudod kikapcsolni a MIB (Sötétben mozgás) funkciót a paraméterhez. Ez jó ötlet lehet néhány színváltó beállításánál. Állítsd On-ra, hogy kikapcsold az MIB-t.</li>
		<li><strong>Profile:</strong><br />
			Itt rendelhetsz DMX profilt a paraméterhez. A cella szerkesztésekor megnyílik a kicsi DMX profil ablakocska. Ez mutatja az elérhet&otilde; DMX profilokat. A DMX profilokról <a href="key_dmx_profiles.html">itt olvashatsz</a>.
		</li>
	</ul>

	<p>&nbsp;</p>

	<p>Az itt történ&otilde; változások azonnal végrehajtódnak.</p>

	<p>Ezeket megváltotazhatod a lámpa szerkesztésekor is (Edit Fixture X).</p>


</body>

</html>
