<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Mi a különbség az egy- és többfelhasználós rendszerek között</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="single-user system, multi-user system, full tracking backup" />
	</head>
	<body>
		
		
		<h1>Mi a különbség az egy- és többfelhasználós rendszerek között</h1>
		
		<p>Amikor rendszerr&otilde;l beszélünk, gyakran a munkamenetet jelenti.</p>

<p>At Ethernet hálózaton több munkamenet is futhat.</p>

<p>A munkamenetben, lehet egy, néhány, vagy sok MA eszköz mint tag, vagy mint hallgató.</p>

<p>Ez az oldal megpróbálja leírni ezek között a különbségeket.</p>

<p>&nbsp;</p>

<h2>Egyfelhasználós munkamenet</h2>

<p>Egyfelhasználós munkamenetben, csak egy kezel&otilde;/programozó van. Ennek az emberkének lehet egy vagy néhány állomása (pult vagy onPC).</p>

<p>Ha csak egy felhasználó van, akkor az összes állomáson ugyanaz a felhasználó van bejelentkezve.</p>

<p>Ezt úgy is hívják "Full Tracking Backup". Az állomások mind szinkronban vannak és megosztják a különböz&otilde; nézeteket és a programozó tartalmát ugyanúgy minden állomáson.</p>

<p>Ez hasznos ha egy kezel&otilde; van. Ha az egyik állomás hibázik, a kezel&otilde; átmehet egy másik állomáshoz és ott folytathatja a dolgait anélkül, hogy bármit elvesztene.</p>

<p>Ez a kezel&otilde; általában teljes hozzáféréssel rendelkezik az egész rendszer felett.</p>

<p>&nbsp;</p>

<h2>Többfelhasználós munkamenet</h2>

<p>Többfelhasználós munkamenetben, több kezel&otilde; van. Használhatják ugyanazt az állomást és cserélhetnek is (váltásban dolgoznak vagy más fázisában a m&Ucirc;veleteknek). Ez lehet egy rendszer több felhasználóval, akik egyid&otilde;ben dolgoznak, különböz&otilde; állomásokon.</p>

<p>Ehhez a beállításhoz az operátoroknak több felhasználót és valószín&Ucirc;leg több felhasználói profilt kell létrehozniuk. Ezután minden üzemeltet&otilde; a felhasználója segítségével bejelentkezik az állomásra, és vezérelheti a teljes rendszert vagy csak a rendszer egy részét.</p>

<p>Az állomások megosztják a show fájlt, és az Executorok egyaránt szinkronban vannak, de a felhasználóknak különböz&otilde; nézeteik lehetnek a képerny&otilde;kön, és a programozójuk sincs megosztva - a kimenet megvan.</p>

<p>Néha a rendszer ezek keveréke; Van több kezel&otilde; (Több felhasználó), de mindegyik kezel&otilde;nek kett&otilde; (vagy több) állomása van bejelentkezve a felhasználójával (Full Tracking Backup).</p>

<p> Többfelhasználós rendszerben különböz&otilde; kezel&otilde;i jogokkal rendelkez&otilde; felhasználók lehetnek. A jogoknak több szintje van. A teljes hozzáférést&otilde;l a nézet megváltoztatásának engedélyezéséig terjednek.</p>

<p>A felhasználói profilok szintén csak egy adott világra korlátozhatók. Ez csak akkor engedélyezi a felhasználó számára, hogy hozzáférjen a lámpák egy részéhez.</p>
		
	</body>
</html>
