<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Chaser l&eacute;trehoz&aacute;sa</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="chaser - create" />
	</head>
	<body>
		
		
		<h1>Chaser l&eacute;trehoz&aacute;sa</h1>
		
		<p>Chaser l&eacute;trehoz&aacute;s&aacute;hoz, k&eacute;sz&iacute;ts egy szekvenci&aacute;t legal&aacute;bb 2 k&eacute;ppel, amit hozz&aacute;rendelt&eacute;l egy executorhoz.</p>

<ol>
	<li>A szekvencia chaserr&eacute; alak&iacute;t&aacute;s&aacute;hoz nyomd meg az <span class="hardkey">Assign</span> gombot &eacute;s az executorhoz hozz&aacute;rendelt gombot.</li>
	<li>Ez megnyitja az Assign(hozz&aacute;rendel&eacute;s) men&uuml;t. B&ouml;kj az <span class="softkey">Options</span>-ra&nbsp;a jobb oldalon.</li>
	<li>Az &aacute;tv&aacute;lt&aacute;shoz b&ouml;kj a <span class="softkey">Chaser</span>-re&nbsp;, ami a <strong>Function</strong> f&uuml;l alatt van.</li>
</ol>

<p>A mini executor most ci&aacute;n sz&iacute;n&#369; lett.</p>

<p>Lehets&eacute;ges az executorhoz hozz&aacute;rendelt gombok &eacute;s a fader funkci&#337;inak megv&aacute;ltoztat&aacute;sa. Tov&aacute;bbi inform&aacute;ci&#337;k&eacute;rt, l&aacute;sd:&nbsp;<a href="key_exec_assign.html">Funkci&#337; hozz&aacute;rendel&eacute;se</a>.</p>

<p>Minden be&aacute;ll&iacute;tott id&#337;z&iacute;t&eacute;s &eacute;s loopol&aacute;si inform&aacute;ci&#337; &aacute;t lesz ugorva a szekvenci&aacute;ban. A parancsok a k&eacute;pekn&eacute;l (CMD) v&eacute;grehajt&#337;dik &eacute;s a <strong>CMD Delay</strong> az egyetlen id&#337;z&iacute;t&eacute;s ami a szekvenci&aacute;b&#337;l felhaszn&aacute;l&#337;dik. Tov&aacute;bbi inform&aacute;ci&#337;k&eacute;rt l&aacute;sd: <a href="key_cs_cmd_in_cues.html">Parancsok haszn&aacute;lata a k&eacute;pekben</a>.</p>

<hr />
<h2>Chaser elind&iacute;t&aacute;sa, meg&aacute;ll&iacute;t&aacute;sa, &eacute;s szüneteltetése.</h2>

<ul>
	<li>A chaser <strong>ind&iacute;t&aacute;s&aacute;hoz</strong>, nyomd meg a <span class="hardkey">Go+</span>-t&nbsp;&eacute;s egy az executorhoz hozz&aacute;rendelt gombot. A chaser be&uacute;sztat&aacute;s&aacute;hoz, nyomd meg a&nbsp;<span class="hardkey">Go+</span>&nbsp;<span class="hardkey">Time</span>-t &eacute;s add meg az &uacute;sz&aacute;sid&#337;t m&aacute;sodperceben, p&eacute;ld&aacute;ul &nbsp;<span class="hardkey">5</span>.</li>
	<li>A chaser <strong>le&aacute;ll&iacute;t&aacute;s&aacute;hoz</strong>, nyomd meg az&nbsp;<span class="hardkey">Off</span>&nbsp;&eacute;s egy, az executorhoz hozz&aacute;rendelt gombot. A chaser ki&uacute;sztat&aacute;s&aacute;hoz, nyomd meg az &nbsp;<span class="hardkey">Off</span>&nbsp;<span class="hardkey">Time</span>&nbsp;-t &eacute;s add meg az &uacute;sz&aacute;sid&#337;t m&aacute;sodpercben, p&eacute;ld&aacute;ul&nbsp;<span class="hardkey">5</span>.</li>
	<li>A chaser <strong>	szüneteltetéséhez</strong> , nyomd meg a&nbsp;<span class="hardkey">Pause</span>-t. A chaser meg&aacute;ll az aktu&aacute;lis l&eacute;p&eacute;sben &eacute;s tartja a kimenet&eacute;t ennek a l&eacute;p&eacute;snek. A chaser folytat&aacute;s&aacute;hoz, nyomd meg a &nbsp;<span class="hardkey">Pause</span>-t m&eacute;gegyszer.</li>
</ul>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

		
	</body>
</html>
