<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Ideiglenes sz&ucirc;r&otilde;k használata</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="temporary filter, filter - store, at filter, if - filter, endif - filter" />
	</head>
	<body>
		
		
		<h1>Ideiglenes sz&ucirc;r&otilde;k használata</h1>
		
		<p>A sz&ucirc;r&otilde; tárolóban lév&otilde; és el&otilde;re beállított sz&ucirc;r&otilde;kön kívül, használhatsz ideiglenes sz&ucirc;r&otilde;ket is.</p>

<p>Ugyanazokat az akciókat tudod végrehajtani velük mint a filter tárolóban lév&otilde;kkel.</p>

<p>A következ&otilde; szöveg leírja, hogyan tudsz megnyitni ideiglenes sz&ucirc;r&otilde; ablakocskát. De van még a <a href="key_wfm_create_filters.html#command_filter">Parancs Sz&ucirc;r&otilde; ablakod is</a> valamelyik képerny&otilde;n, ezt is használhatod.</p>

<p>A következ&otilde; szövegben, felfedezzük az ideiglenes sz&ucirc;r&otilde;ket néhány példán keresztül, ugyanolyan példákon, mint amit a  <a href="key_wfm_use_filter.html">Sz&ucirc;r&otilde;k használata programozáskor fejezetben</a>. Ha még nem olvastad volna, akkor itt a remek alkalom.</p>

<h2>Temporary Store Filter - Ideiglenes tároló sz&ucirc;r&otilde;(ITS)</h2>

<p>Elérheted az ITS-t a <span class="hardkey">Store</span> gomb nyomvatartásával. Most látod a <a href="key_cs_store_options_default.html">Store Encoder Toolbar-t</a> a 2. képerny&otilde; alján. Ebben az eszköztárban van egy gomb amit <span class="softkey">Store Filter-Tároló Sz&ucirc;r&otilde;nek</span> hívnak. Rábökve megnyílik egy sz&ucirc;r&otilde; szerkeszt&otilde; ablakocska. Ez ugyanúgy m&ucirc;ködik mint ahogy a <a href="key_wfm_create_filters.html">Sz&ucirc;r&otilde;k készítése fejezetben</a> láttuk. Van két extra gomb a jobb oldalon, ezek a "Reset Filter on Clear-Sz&ucirc;r&otilde; törlése törléskor" és "Store Filter and Select-Sz&ucirc;r&otilde; tárolása és kiválasztása".</p>

<p><strong>Reset Filter on Clear:</strong></p>

<p>Általában a sz&ucirc;r&otilde;t visszaállítjuk amikor végrehajtod a (tárolás) akciót, de lehet, hogy kellene még a sz&ucirc;r&otilde;. Akkor aktiváld ezt a gombot. Ilyenkor csak a Clear(All) parancs törli a kiválasztott sz&ucirc;r&otilde;t.</p>

<p><strong>Store Filter and Select:</strong></p>

<p>Erre a gombra bökve az aktuális sz&ucirc;r&otilde;beállítások elment&otilde;dnek a következ&otilde; szabad sz&ucirc;r&otilde; tároló helyre, és megkérdezi a nevét. Az új sz&ucirc;r&otilde; is kiválasztódik ilyenkor, nem csak az eddig alkalmazott sz&ucirc;r&otilde;.</p>

<h3>Példa az ideiglenes tárolósz&ucirc;r&otilde;re</h3>

<p>A következ&otilde; példa ugyanaz mint amit a <a href="key_wfm_use_filter.html">Sz&ucirc;r&otilde;k használata programozáskor fejezetben</a> mutattunk.</p>

<p>Megnézünk egy praktikus helyzetet, amikor a sz&ucirc;r&otilde;k segítségével gyorsabban lehet dolgozni.</p>

<ol>
	<li>Használd a "Demo Dimmer and more" demo showt vagy egy showt néhány lámpával.</li>
	<li>Nézd meg, hogy a kiválasztott sz&ucirc;r&otilde; az "All" legyen, tehát semmi ne legyen sz&ucirc;rve.</li>
	<li>Válassz ki néhány lámpát és adj nekik értékeket, a dimmert is beleértve.</li>
</ol>

<p>Képzeld el ez az amit szeretnél egy képben látni - ez legyen pl. a 2. kép.</p>

<p>Nem akarunk MIB-et használni, de azt akarjuk, hogy a lámpa már álljon be a helyére amikor a 2. képet adjuk. Tehát minden adatot elmentünk, kivéve a dimmer értékét az 1. képben és a dimmer adatát a 2. képben.</p>

<ol start="4">
	<li>Nyomd meg a <span class="hardkey">Store</span> és utána a <span class="softkey">Store Filter</span> gombokat a kódoló sávban.</li>
	<li>Kapcsold ki a "Dim" attribútumot a Tároló sz&ucirc;r&otilde; ablakocskában.</li>
	<li>Nyomj meg egy executor gombot - létrehozva az 1. képet egy új szekvenciában és executorban.</li>
</ol>

<p>Most mindent elmentettél kivéve a dimmer értékeket az 1. képben. A dimmer értékek még aktívak a programozóban, a maradék eltárolódik. Az ideiglenes sz&ucirc;r&otilde; most elt&ucirc;nik és semmi nem sz&ucirc;r&otilde;dik továbbá.</p>

<ol start="7">
	<li>Nyomd meg a <span class="hardkey">Store</span> és ugyanazt az executor gombot.</li>
	<li>Az ablakocskában válaszd a <span class="softkey">Create Second Cue</span>-t.</li>
</ol>

<p>Ez lett a második kép. Töröld a programozót és próbáld meg futtatni a képet.</p>

<hr />
<h2>Temporary At Filter - Ideiglenes At sz&ucirc;r&otilde;(TAF)</h2>

<p>A TASF olyan mintha a sz&ucirc;r&otilde; tárolóban lennél.</p>

<p>Tartsd nyomva az <span class="hardkey">At</span> gombot kb. .1 másodpercig és megnyílik a sz&ucirc;r&otilde; ablakocska.</p>

<p>Ebben az ablakban van két extra gomb, ami már fent le lett írva.</p>

<p>Alul találsz még három extra gombot. Ezek színtranszformáló gombok. Arra használjuk, hogy mi történjen ha a forrás és a cél lámpának nincs azonos szín attribútuma.</p>

<p><strong>MixColor:</strong></p>

<p>Ez a MixColor rendszert használja. A beállításoktól függ&otilde;en lehet Open értéket állítani bármely színkörben.</p>

<p><strong>Color Wheel:</strong></p>

<p>Ez a legközelebbi színt használja a színkeréken. Beállítástól függ&otilde;en ez is beállítható Open értékre a MixColor rendszerben.</p>

<p><strong>MixColor + Col Wheel:</strong></p>

<p>Ez mindkét lehet&otilde;séget használja a legjobb eredmény elérése érdekében.</p>

<h3>Példa</h3>

<p>A következ&otilde; példa, ugyanaz amit már a <a href="key_wfm_use_filter.html">Sz&ucirc;r&otilde;k használata a programozáshoz fejezetben</a> használtunk.</p>

<p>Ebben a példában csak a színeket vesszük ki az egyik lámpából és áttesszük a másikra.</p>

<ol>
	<li>Használd a "Demo Dimmer and more" demo showt, vagy egy másik showt amiben néhány lámpa van és néhány sz&ucirc;r&otilde;.</li>
	<li>Legyen a kiválasztott sz&ucirc;r&otilde; az "All" sz&ucirc;r&otilde;.</li>
	<li>Válassz lámpát és adj nekik értéket néhány attribútúmára a dimmer, pozíció, és mixcolor értékeket is, hogy új színben ússzon át.</li>
	<li>Válassz egy másik lámpát és adj neki egy másik pozíciót és dimmer értéket.</li>
</ol>

<p>Most csak a szín értékeket vesszük az els&otilde; lámpából. Nem akarjuk a pozíció és dimmer értékekt elvenni, csak a színeket.</p>

<ol start="5">
	<li>Tartsd nyomva az <span class="hardkey">At</span> gombot ameddig a sz&ucirc;r&otilde; ablakocska megjelenik.</li>
	<li>Bökj a None gombra a fejlécen, tehát ne legyen attribútum kiválasztva.</li>
	<li>Bökj a <span class="softkey">Color</span> preset típusra, hogy bekapcsolódjon. Ez átengedi az összes színinformációt a sz&ucirc;r&otilde;n.</li>
	<li>Bökj az els&otilde; lámpára a képerny&otilde;n (vagy használd a  - <span class="hardkey">Fixture</span> [szám] <span class="hardkey">Please</span> gombokat).</li>
</ol>

<p>Most mindkét lámpának azonos a színe.</p>

<hr />
<h2>Ideiglenes sz&ucirc;rés az If gomb használatával</h2>

<p>Az At parancs tárolása vagy használata közben tartalmazhat egy beágyazott feltételt. Az állapot szinte bármi lehet, és sokféle elemet tartalmazhat.</p>

<p>A feltételt az <span class = "hardkey"> If </span> gombbal ágyazhatjuk be. Tarthatod nyomva a billenty&ucirc;t, ha összetett állapotot hozol létre, vagy röviden megnyomhatod, ha egyszer&ucirc;bb feltételr&otilde;l van szó.</p>

<p>A beágyazás az <a href="key_keyword_if.html">If parancs</a> és az <a href="key_keyword_endif.html">EndIf parancs</a> között történik. Az EndIf elérhet&otilde; mint parancs az <span class="hardkey">If</span> gombbal, miután beírtad az els&otilde; If parancsot. Néha a szoftver automatikusan hozzáadja az EndIf parancsot.</p>

<p>A feltételek beállítása a különböz&otilde; elemek megnyomásával történik a képerny&otilde;n, de parancsként is beírhatóak. A feltételek lehetnek pozitívak és negatívak is. Például: Ha csak pozíció értékeket akarsz akkor egyszer&ucirc;en csak bökj rá a  <span class="softkey">Position</span> gombra a Preset Vezérl&otilde; Sávban. Ha minden más értéket akarsz, kivétel a pozíció értékeit, akkor megnyomhatod a <span class="hardkey">-</span> gombot és utána a <span class="softkey">Position</span> gombot, hogy a következ&otilde; parancs: <span class="syntax">If - PresetType "POSITION" EndIf</span> legyen a prancssorban.</p>

<p>&nbsp;</p>

<h3>Példák</h3>

<p>A következ&otilde; két példát használjuk amit az <span class="hardkey">If</span> gombnál már csináltunk.</p>

<ol>
	<li>Használd a "Demo Dimmer and more" demo showt, vagy egy másik showt amiben van néhány lámpa.</li>
	<li>Legyen a kiválasztott sz&ucirc;r&otilde; az "All" sz&ucirc;r&otilde;, ez nem sz&ucirc;r semmit.</li>
	<li>Válassz lámpát és adj nekik értéket néhány attribútúmára a dimmerrel együtt.</li>
</ol>

<p>Képzeljük el, hogy ezt akarjuk látni egy képben - ez lesz a 2. kép.</p>

<p>Nem akarjuk használni az MIB-t, de szeretnénk, hogy a lámpák már beálljanak, amikor futtatjuk a 2. képet. Tehát a dimmer kivételével minden adatot az 1. képre mentünk és a dimmert tesszük a 2.-ba.</p>

<ol start="4">
	<li>Nyomd meg a <span class="hardkey">Store</span>gombot.</li>
	<li>Nyomd meg az  <span class="hardkey">If</span> gombot, és utána a <span class="hardkey">-</span>-t. Most a sz&ucirc;r&otilde; aktív és már kiválasztottuk amit nem szeretnénk tárolni.</li>
	<li>Ki akarjuk hagyni a dimmert, szóval bökj a <span class="softkey">Dimmer</span> gombra a <a href="key_ws_preset_control_bar.html">Preset Vezérl&otilde; Sávban</a>.</li>
	<li>Zárd le az ideiglenes st&ucirc;r&otilde;t az <span class="hardkey">If</span> ismételt megnyomásával. Most a parancssorban ez olvasható: <span class="syntax">Store If - PresetType "DIMMER" EndIf</span>.</li>
	<li>Nyomj meg egy üres executor gombot - készítettél egy új szekvenciát egy executoron 1. kép néven.</li>
</ol>

<p>Most minden értéket eltároltál, kivéve a dimmert az 1. képben. A dimmer értékek még aktívak a programozóban, a maradék eltárolódott.. Az ideiglenes sz&ucirc;r&otilde; elt&ucirc;nt és nincs további sz&ucirc;rés.</p>

<ol start="9">
	<li>Nyomd meg a <span class="hardkey">Store</span> gombot, és utána ugyanazt az executor gombot.</li>
	<li>Az ablakocskában válaszd a <span class="softkey">Create Second Cue</span>.</li>
</ol>

<p>Ez egy példa volt, a hogyan használjuk az If parancsot, hogy kihagyjunk egy attribútumot - aktuálisan egy preset típust.</p>

<p>&nbsp;</p>

<p>A következ&otilde; példa megmutatja, hogyan lehet átengedni néhány attribútumot a sz&ucirc;r&otilde;n.</p>

<p>Ebben a példában csak a szín értékét vesszük egy lámpának és alklalmazzuk egy másikra.</p>

<ol>
	<li>Használd a "Demo Dimmer and more" demo showt, vagy egy másik showt amiben van néhány lámpa és néhány sz&ucirc;r&otilde;.</li>
	<li>Legyen a kiválasztott sz&ucirc;r&otilde; az "All" sz&ucirc;r&otilde;, ez nem sz&ucirc;r semmit.</li>
	<li>Válaszd ki az 1. lámpát és adj neki értékeket, mint dimmer, pozíció, és a MixColor.</li>
	<li>Válassz egy másik lámpát és adj neki más pozíciót és dimmer értéket.</li>
</ol>

<p>Most szeretnénk az els&otilde; lámpáról csak a szín értéket kivenni. Nem szeretnénk a pozíciót és a dimmert a lámpából, csak a színt.</p>

<ol start="5">
	<li>Nyomd meg az <span class="hardkey">At</span> <span class="hardkey">Fixture</span> <span class="hardkey">1</span> <span class="hardkey">If</span> gombokat. Most kiválaszthatod melyik sz&ucirc;r&otilde;t akarod használni.</li>
	<li>Minden színinformációra szükség van, ezért bökj a <span class="softkey">Color</span> gombra a preset vezérl&otilde;sávban. Az "EndIf" parancs automatikusan beíródik, amikor egyszer&ucirc; dologra böksz az iIf gomb után</li>
	<li>Nyomd meg a <span class="hardkey">Please</span> gombot a parancs végrehajtásához.</li>
</ol>

<p>Most mindkét lámpának ugyanaz a szín értéke.</p>

		
	</body>
</html>
