<!DOCTYPE html>
<html lang="hu">
	<head>
		<title>Chaser beállításai</title>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
		<meta charset="utf-8" />
		<meta name="keywords" content="chaser settings, chaser encoder toolbar, chaser - edit, encoder toolbar - chaser" />
	</head>
	<body>


		<h1>Chaser beállításia</h1>

		<h2>A Chaser Kódoló eszköztára</h2>

<p>A <strong>Chaser Kódoló Eszköztára</strong> segítségével szerkesztheted a chasert. Az eszköztár megnyitásához, nyomd meg az <span class="hardkey">Edit</span> és az executorhoz hozzárendelt gombok egyikét.</p>

<p>Több lehetséges opció van a chaser beállításához a cián színű <strong>Chaser Kódoló Eszköztárban</strong>.</p>

<figure class="caption"><img alt="" src="../../img/window_chaser_encoder_toolbar.png" />
<figcaption><em>Chaser kódoló eszköztár</em></figcaption>
</figure>

<hr />
<h2>A Chaser szerkesztése gomb</h2>

<p>Bökj az <span class="softkey">Edit Chaser</span> gombra. Ez megnyitja a <strong>Chaser Szerkeszt&otilde; ablakot</strong>.</p>

<figure class="caption"><img alt="" src="../../img/popup_edit_chaser.png" />
<figcaption><em>Chaser szerkeszt&otilde; ablak</em></figcaption>
</figure>

<p>A chaser elnevezéséhez, bökj a  <span class="softkey">Label(cimke)</span> feliratra.</p>

<p> </p>

<p>A chaser irányának kezeléséhez, bökj az<span class="softkey">Direction</span>-irányokra. Az alapértelmezett irány az el&otilde;re. Ez a gomb megnyitja a chaser futásmód  <strong>felugró ablakot</strong> négy választási lehet&otilde;séggel.</p>

<figure class="caption"><img alt="" src="../../img/popup_select_chaser_run_mode_v3_3.png" />
<figcaption><em>Chaser futásmód választás</em></figcaption>
</figure>

<ul>
	<li><strong>Forward</strong> és <strong>Backward</strong> futtatja a chasert a megadott irányokban (el&otilde;re - visszafelé).</li>
	<li><strong>Bounce</strong> végigmegy a lépéseken el&otilde;röl, majd visszafelé kezd lépkedni. Ez folytatódik az els&otilde; lépésig, majd újra indul -pattog- a két végpont között.</li>
	<li><strong>Random</strong> a lépések véletlenszerűen követik egymást.</li>
</ul>

<p> </p>

<p> </p>

<p>Bökj a  <span class="softkey">Loop Endless</span> -re és a <strong>Loop Options</strong> (ismétlési opciók) megnyílik, három különböz&otilde; <strong>Ismétlési</strong> opcióval:</p>
<figure class="caption"><img alt="" src="../../img/popup_select_chaser_loop_mode_v3_3.png" />
<figcaption><em>Select Chaser Loop Mode ablakocska</em></figcaption>
</figure>

<ul>
	<li><strong>Endless</strong> (végtelen) a chaser addig fut, ameddig nem kap új információt.</li>
	<li><strong>Shoot-Off</strong> a lépéseken egyszer végigmegy, utána kikapcsolja a chasert.</li>
	<li><strong>Shoot-On</strong> a lépéseken egyszer végigmegy, utána az utolsó lépésben tartja a chasert.</li>
</ul>

<p> </p>

<p><strong> </strong><span class="softkey">Edit Current</span>, <span class="softkey">Edit Previous</span> és az <span class="softkey">Edit Next</span> gombok a képeket szerkesztik. További információkért, lásd: <a href="key_cs_cue_sequence.html#edit_cue">A képszekvenciák megtekintése</a>.</p>

<p><br />
A Chaser <strong>Sebességének</strong> beállításához bökj a <span class="softkey">Speed Individual</span>-ra. Ez megnyitja a <strong>Select Speed Group</strong> (Válassz sebességcsoportot) ablakocskát.</p>

<figure class="caption"><img alt="" src="../../img/popup_select_speed_group_v3_3.png" />
<figcaption><em>Sebességcsoport választása ablakocska</em></figcaption>
</figure>

<ul>
	<li><strong>Individual speed</strong> a chasert a <strong>sebesség teker&otilde;kén</strong> beállított érték szerint futtatja.</li>
	<li><strong>Speed 1</strong>-t&otilde;l  <strong>Speed 15</strong>-ig  egy <strong>Speed Master</strong> által vezérli a sebességét a chasernak. Ez hasznos ha szinkronban akarsz tartani több chasert és effektet. B&otilde;vebben lásd: <a href="key_exec_assign.html">Funkciók hozzárendelése</a>.</li>
	<li>A <strong>BPM</strong> opció méri a beütés/másodperc az Audio In jelb&otilde;l. További olvasnivaló: <a href="key_ost_sound_input_window.html">Hang bemenet</a>.</li>
</ul>

<p> </p>

<p>A <strong>CMD</strong> mez&otilde; engedélyézeséhez/letiltásához a Chaser Executor lapon, bökj a <span class="softkey">Cmd Disable</span> gombra. Ha a CMd le van tiltva, akkor a <span class="softkey">CMD Disable</span> cián színű lesz, és minden parancs a <strong>CMD</strong> oszlopban az <strong>Executor lapon</strong> pirossal lesz mutatva.</p>

<p>Van lehet&otilde;ség a parancsok tesztelésére a <strong>CMD</strong> mez&otilde;ben. Ha az aktuális lépés aktív és egy parancsot írsz a <strong>CMD</strong> mez&otilde;be, bökj a <span class="softkey">Test Cmd</span>-re a funkció teszteléséhez.</p>

<p> </p>

<p>Néha a chasernek jó ha megtartja az ütemet, de megduplázzuk vagy felezzük a sebességét.</p>

<ul>
	<li>Az érték felezéséhez, bökj a <span class="softkey">Half Speed</span>-re.</li>
	<li>Az érték megduplázásához, bökj a<span class="softkey">Double Speed</span>-re. </li>
	<li><span class="softkey">Speed 1:1</span> visszaállítja a sebesség értékét a Sebesség teker&otilde;nek, a Speed Master vagy az Audio in-re, a kiválasztott Speed grouptól attól függ&otilde;en.</li>
</ul>

<p>Másik lehet&otilde;ség, ha ráböksz a <span class="softkey">Speed</span>-re. Ez megnyitja a <strong>Select Speed Facrtor</strong> ablakocskát. Ez hasznos lehet ha szorozni, vagy osztani akarod a sebességet 2, 4, 8, 16, vagy 32-vel a kiválasztott Speed Groupban.</p>

<p> </p>

<p>Az <strong>Edit Chaser</strong>b&otilde;l kilépéshez bökj a<img alt="" src="../../img/icon_close_v3-2.png" />-ra. </p>

<hr />
<h2>A Lejátszás Gombok</h2>

<p>A gombok amikkel a chasert lehet elindítani, megállítani, és szüneteltetni:</p>

<ul>
	<li>A chaser indításához, bökj a<img alt="" src="../../img/icon_play_v3-2.png" />. Ez elindítja a chasert az els&otilde; képt&otilde;l az utolsóig, és utána kezdi az els&otilde;t&otilde;l.</li>
	<li>A chaser indításához, az utolsótól az els&otilde; képig, bökj a <img alt="" src="../../img/icon_go-back_v3-2.png" />. ez elindítja hátulról a képeket visszafelé, majd ismétli.</li>
	<li>A chaser megállításához, bökj a <img alt="" src="../../img/icon_off_v3-2.png" /> . </li>
	<li>A chaser szüneteltetéséhez, az aktuális lépésben, és a kimenet megtartásához bökj a <img alt="" src="../../img/icon_pause_v3-2.png" />-ra. Bökj a <img alt="" src="../../img/icon_pause_v3-2.png" /> a chaser futásának folytatásához, az aktuális lépést&otilde;l.</li>
	<li>A chaser megállításához és egyenkénti léptetéséhez, bökj a <img alt="" src="../../img/icon_skip-minus_v3-2.png" /> vagy <img alt="" src="../../img/icon_skip-plus_v3-2.png" />ikonokra. </li>
</ul>

<hr />
<h2>A kódoló rész</h2>

<p>A négy teker&otilde;nek 6 különböz&otilde; funkciója van. A négy alapfunkció elérhet&otilde;, amikor a gomb azt mutatja <span class="softkey">Basic 1 of 2</span>. Ha ráböksz a gombra ismét , akkor megváltozik <span class="softkey">Advanced 2 of 2</span>-re.</p>

<p>Alapvet&otilde; gombok balról kezdve:</p>

<ol>
	<li>Az els&otilde; kódolótárcsa a <strong>Master</strong>. Ez a mester vezérli a chaser intenzitását százalékban.</li>
	<li>A második tárcsa a <strong>Speed,</strong> alapértelmezetten BPM(beütés per másodperc)-ben mutatja az értéket. Ez állítja az id&otilde;t a képek között a chaserben. Tehát ha a sebesség 60BPM, akkor a képek minden másodpercben váltják egymást. A sebesség kiolvasását a Setup->User->Settings-nél lehet beállítani.</li>
	<li>A harmadik tárcsa a <strong>Step</strong> úszása, százalékban mérve. Ez a tárcsa állítja az átúszási id&otilde;t a lépések között. Amikor a százalék 0, akkor a chaser azonnal ugrik a lépések között. Amikor 100% akkor a speed tárcsán beállított értéket használja. Amikor a százalék 100 fölött van, akkor a chaser elkezd kiúszni, miel&otilde;tt a lépés elérné a végét. A be és kiúszási százalékot külön lehet állítani. További infók lásd lejjebb. </li>
	<li>A negyedik tárcsa a <strong>Master Fade</strong> kezeli a be-ki úszási idejét a chasernek. Az id&otilde; itt másodpercben mér&otilde;dik.</li>
</ol>

<p>A két további lehet&otilde;ség eléréséhez, bökj a <span class="softkey">Basic 1 of 2</span> gombra. A gomb átvált <span class="softkey">Advanced 2 of 2</span>-re.</p>

<p>A két tárcsa balról jobbra:</p>

<ol>
	<li>Az els&otilde; tárcsa, a <strong>In-fade</strong> állítja a be. ha a százalék 0, a chaser átugrik a következ&otilde; lépésre, és ha 100% akkor a speed tárcsán beállított értéket veszi figyelembe. Amikor ez 100 fölött van a chaser elkezd kiúszni, miel&otilde;tt a step érték teljes lesz.</li>
	<li>A második tárcsa az <strong>Out-fade</strong>-et állítja be. Amikor a százalék 0, akkor a chaser ugrik 0-ra, amikor 100, akkor meg a speed tárcsán beállított érték lesz a meghatározó.</li>
</ol>


	</body>
</html>
